Key:        LU-18998
Summary:    Bufer over-read in lnet_fault_attr_to_attr4
Link:       https://jira.whamcloud.com/browse/LU-18998
Type:       Bug
Priority:   Minor
Status:     Resolved
Resolution: Fixed
Assignee:   James A Simmons
Reporter:   Oleg Drokin
Created:    Sat, 10 May 2025 08:13:01 +0000
Updated:    Wed, 20 Aug 2025 23:44:22 +0000
Resolved:   Wed, 20 Aug 2025 11:39:41 +0000
Labels:     smatch
Links:      Related: is related to  LU-9680; Related: is related to  LU-18417

--- Description ---
Smatch highlights this issue in lnet_fault_attr_to_attr4():

 __builtin_memcpy() '&attr->u' too small (16 vs 64)

 static void
lnet_fault_attr_to_attr4(struct lnet_fault_large_attr *attr,
                         struct lnet_fault_attr *attr4)
{
        if (!attr)
                return;
        attr4->fa_src = lnet_nid_to_nid4(&attr->fa_src);
        attr4->fa_dst = lnet_nid_to_nid4(&attr->fa_dst);
        attr4->fa_local_nid = lnet_nid_to_nid4(&attr->fa_local_nid);
        attr4->fa_ptl_mask = attr->fa_ptl_mask;
        attr4->fa_msg_mask = attr->fa_msg_mask;
        memcpy(&attr4->u, &attr->u, sizeof(attr4->u));
}

So I guess the idea is to take sizeof attr->u? ot otherwise make sure we are not reading or writing any more than we can.

Introduced in https://review.whamcloud.com/c/fs/lustre-release/+/53731

--- Comment (gerrit, Wed, 20 Aug 2025 23:44:22 +0000) ---
"James Simmons " uploaded a new patch: https://review.whamcloud.com/c/fs/lustre-release/+/60840

Subject: Revert "LU-18998 lnet: match size of LNet fault handling"

Project: fs/lustre-release

Branch: master

Current Patch Set: 1

Commit: 336d9ac83bc151072b9a11de238df58d7fb8cf91

--- Comment (pjones, Wed, 20 Aug 2025 11:39:41 +0000) ---
Merged for 2.17

--- Comment (gerrit, Wed, 20 Aug 2025 03:07:58 +0000) ---
"Oleg Drokin " merged in patch https://review.whamcloud.com/c/fs/lustre-release/+/60370/

Subject: LU-18998 lnet: match size of LNet fault handling

Project: fs/lustre-release

Branch: master

Current Patch Set: 

Commit: b3c718fb5f2e162f2cd7a4a357e1e1302c89071e

--- Comment (gerrit, Fri, 25 Jul 2025 00:23:20 +0000) ---
"James Simmons " uploaded a new patch: https://review.whamcloud.com/c/fs/lustre-release/+/60370

Subject: LU-18998 lnet: match size of LNet fault handling

Project: fs/lustre-release

Branch: master

Current Patch Set: 1

Commit: 77f8d0161756241263a6d132e3fcac4d4460ed1b

--- Comment (simmonsja, Wed, 16 Jul 2025 17:27:16 +0000) ---
I think patch for LU-19167 will resolve this naturally.

--- Comment (simmonsja, Wed, 16 Jul 2025 17:10:42 +0000) ---
Since struct lnet_fault_large_attr is internal to the kernel it can easily be updated to add the u64 space[8]. Eventually lnet_fault_larget_attr will out grow the old IPv4 version.

--- Comment (adilger, Fri, 16 May 2025 00:48:02 +0000) ---
I think the real bug is that lnet_fault_large_attr.u is missing "__u64 space[8]" so it is not actually as large as lnet_fault_attr.u (16 vs. 64 bytes as it reports):

struct lnet_fault_attr {
        lnet_nid_t                 fa_src;               /*     0     8 */
        lnet_nid_t                 fa_dst;               /*     8     8 */
        lnet_nid_t                 fa_local_nid;         /*    16     8 */
        __u64                      fa_ptl_mask;          /*    24     8 */
        __u32                      fa_msg_mask;          /*    32     4 */
        /* XXX 4 bytes hole, try to pack */
        union {
                struct {
                        __u32      da_rate;              /*    40     4 */
                        __u32      da_interval;          /*    44     4 */
                        __u32      da_health_error_mask; /*    48     4 */
                        __u32      da_random:1;          /*    52: 0  4 */
                        __u32      da_drop_all:1;        /*    52: 1  4 */
                } drop;                                  /*    40    16 */
                struct {
                        __u32      la_rate;              /*    40     4 */
                        __u32      la_interval;          /*    44     4 */
                        __u32      la_latency;           /*    48     4 */
                } delay;                                 /*    40    12 */
                __u64              space[8];             /*    40    64 */
        } u;                                             /*    40    64 */

        /* size: 104, cachelines: 2, members: 6 */
        /* sum members: 100, holes: 1, sum holes: 4 */
        /* last cacheline: 40 bytes */
};

struct lnet_fault_large_attr {
        struct lnet_nid            fa_src;               /*     0    20 */
        struct lnet_nid            fa_dst;               /*    20    20 */
        struct lnet_nid            fa_local_nid;         /*    40    20 */
        /* XXX 4 bytes hole, try to pack */
        /* --- cacheline 1 boundary (64 bytes) --- */
        u64                        fa_ptl_mask;          /*    64     8 */
        u32                        fa_msg_mask;          /*    72     4 */
        union {
                struct {
                        u32        da_rate;              /*    76     4 */
                        u32        da_interval;          /*    80     4 */
                        u32        da_health_error_mask; /*    84     4 */
                        u32        da_random:1;          /*    88: 0  4 */
                        u32        da_drop_all:1;        /*    88: 1  4 */
                } drop;                                  /*    76    16 */
                struct {
                        u32        la_rate;              /*    76     4 */
                        u32        la_interval;          /*    80     4 */
                        u32        la_latency;           /*    84     4 */
                } delay;                                 /*    76    12 */
        } u;                                             /*    76    16 */

        /* size: 96, cachelines: 2, members: 6 */
        /* sum members: 88, holes: 1, sum holes: 4 */
        /* padding: 4 */
        /* last cacheline: 32 bytes */
};

That said, I'm not sure if there is some need to keep these structs the same size, but it could be achieved with "__u64 space[3]" to compensate for the larger NIDs, but "__u64 space[8]" would give us more flexibility for the future.

It would also be good to put a __u32 padding member after fa_msg_mask (and fa_local_nid in the "large" struct) so that it is not subject to the whimsy of compilers.
