Key:        LU-14055
Summary:    Write performance regression caused by an commit from LU-13344
Link:       https://jira.whamcloud.com/browse/LU-14055
Type:       Bug
Priority:   Major
Status:     Resolved
Resolution: Fixed
Assignee:   Patrick Farrell
Reporter:   Shuichi Ihara
Created:    Wed, 21 Oct 2020 04:12:56 +0000
Updated:    Wed, 5 Jan 2022 19:51:08 +0000
Resolved:   Wed, 5 Jan 2022 19:51:08 +0000
Links:      Related: is related to  LU-8837; Related: is related to  LU-13344; Related: is related to LU-14580; Related: is related to LU-13601
Attachments: master-revert.svg, master.svg

--- Environment ---
master (commit: 56526a90ae)

--- Description ---
commit 76626d6c52 "LU-13344 all: Separate debugfs and procfs handling" caused write performance regression.  Here is a reproducer and tested workload.

Single Client(Ubuntu 18.04, 5.4.0-47-generic), 16MB O_DIRECT, FPP (128 processes)

# mpirun --allow-run-as-root -np 128 --oversubscribe --mca btl_openib_warn_default_gid_prefix 0 --bind-to none ior -u -w -r
 -k -e -F -t 16384k -b 16384k -s 1000 -u -o /mnt/ai400x/ior.out/file --posix.odirect 

"git bisect" indentified an commit where regression started.

Here is test results.

76626d6c52 LU-13344 all: Separate debugfs and procfs handling

access    bw(MiB/s)  IOPS       Latency(s)  block(KiB) xfer(KiB)  open(s)    wr/rd(s)   close(s)   total(s)   iter
------    ---------  ----       ----------  ---------- ---------  --------   --------   --------   --------   ----

https://review.whamcloud.com/#/c/39482/

If you're able to give these a try, that would be very interesting.  Both should cut the contention on cl_loi_list_lock when doing dio.  I'm not sure precisely what effect they'll have here, but it seems worth trying.

--- Comment (gerrit, Sat, 10 Apr 2021 17:39:43 +0000) ---
Oleg Drokin (green@whamcloud.com) merged in patch https://review.whamcloud.com/41162/

Subject: LU-14055 lmv: reduce struct lmv_obd size

Project: fs/lustre-release

Branch: master

Current Patch Set: 

Commit: e11deeb1e6d114608eac4ee998d4cea22e30b0f5

--- Comment (jhammond, Thu, 14 Jan 2021 15:32:55 +0000) ---
> Attached are two frame graphes on good (reverted whole LU-13344 patches) and bad (master) cases. 

How long did perf run for the two flame graphs? One has 5x the samples as the other. master-revert.svg shows 20% in swapper and 5% in open. Had ior completed startup when perf was run?

--- Comment (adilger, Tue, 12 Jan 2021 07:17:28 +0000) ---
It looks like the contended lock in master.svg is cl_loi_list_lock in both osc_queue_sync_pages()  and brw_interpret().  The cl_loi_list_lock is in struct client_obd.  What is strange is that this field is before the added structure, so I can't see how that would be affected by the new field.  I'll have to check if there is something later in obd_device that is being accessed under that lock.

--- Comment (sihara, Tue, 12 Jan 2021 03:46:22 +0000) ---
Attached are two frame graphes on good (reverted whole LU-13344 patches) and bad (master) cases. 

I see huge amount of spin_locks in osc_queue_sync_pages() under ll_direct_IO() in bad case. There are also several spin_lock impacts in the functions under brw_interpret().

--- Comment (adilger, Sun, 10 Jan 2021 05:57:11 +0000) ---
Strange that the patch to reduce the structure to the previous size (-8 bytes) and the patch to move the new 8-byte field to the end didn't help performance and the patch to reduce the struct size -2000 bytes also didn't help. It is possible my "-8 byte" patch was too complex, and I moved too many fields around?  I had tried to keep the related fields together.

Do you have any idea where the performance is being lost?  Is it high CPU usage or lock contention or something else?

--- Comment (sihara, Sun, 10 Jan 2021 04:36:25 +0000) ---
patch: https://review.whamcloud.com/41178 didn't help and it was still same slow down. let me try your "bisect" ideas to find if it shows good (or still bad) performance.

--- Comment (adilger, Fri, 8 Jan 2021 19:09:55 +0000) ---
Shuichi, if shrinking struct obd_device does not solve the problem, then it seems the problem is caused by a misalignment of some data structure that  follows the added obd_debugfs_vars field.

Can you please try another set of tests that move the "obd_debugfs_vars" line until we isolate the problematic field.  The first test would be to move obd_debugfs_vars to the end of the struct:

 /* --- cacheline 101 boundary (6464 bytes) --- */
-       struct ldebugfs_vars *     obd_debugfs_vars;     /*  6464     8 */
        atomic_t                   obd_evict_inprogress; /*  6472     4 */
        wait_queue_head_t          obd_evict_inprogress_waitq; /*  6480    24 */
        struct list_head           obd_evict_list;       /*  6504    16 */
        rwlock_t                   obd_pool_lock;        /*  6520     8 */
        /* --- cacheline 102 boundary (6528 bytes) --- */                
        __u64                      obd_pool_slv;         /*  6528     8 */
        int                        obd_pool_limit;       /*  6536     4 */
        int                        obd_conn_inprogress;  /*  6540     4 */
        struct lu_ref              obd_reference;        /*  6544     0 */
        struct kset                obd_kset;             /*  6544   160 */
        /* --- cacheline 104 boundary (6656 bytes) was 48 bytes ago --- */
        struct kobj_type           obd_ktype;            /*  6704    72 */
        /* --- cacheline 105 boundary (6720 bytes) was 56 bytes ago --- */
        struct completion          obd_kobj_unregister;  /*  6776    32 */
+       struct ldebugfs_vars *     obd_debugfs_vars;     /*  6464     8 */

to see if this solves the problem (without my other patches).  I've pushed a patch to do this.  If it fixes the problem, then this confirms that the problem is caused by the alignment or cacheline contention on of one of the fields between obd_evict_inprogress and obd_kobj_unregister.  This would be enough to land for 2.14.0 to solve the problem, but I don't want to leave the reason for the problem unsolved, since it is likely to be accidentally returned again in the future (e.g. by landing my patches to shrink lu_tgt_desc or anything else).

To isolate the reason for the problem you would need to "bisect" the 11 fields/366 bytes to see which one is causing the slowdown.

First try moving obd_debugfs_vars after obd_kset to see if this causes the slowdown again.  If not, then the problem is obd_kset or earlier, so try moving it immediately before obd_kset (this is the largest field so makes it difficult to "bisect" exactly).  If the problem is still not seen, move it after obd_evict_list, etc.  Essentially, when obd_debugfs_vars is immediately before the offending struct the performance will be bad, and when it is immediately after the struct then the performance problem should go away.  Once you find out what the structure is, try moving that field to be at the start of struct obd_device so that there is no chance of it being misaligned, after obd_lu_dev and after obd_recovery_expired.  If these also show good performance, then this can be a permanent solution (I would prefer after obd_recovery_expired since these bitfields are very commonly used).

Please run the "pahole" command on the obdclass.ko module to show the "good" and "bad" structures to see what the problem is, and attach the results here.

Neil, James, since the obd_kobj and obd_ktype fields are recent additions and the largest fields in this area, it seems likely that they are the culprit here.  Is there anything "special" about them that would require their alignment, or to avoid cacheline contention?  Are they "hot" and referenced/refcounted continuously during object access?

--- Comment (gerrit, Fri, 8 Jan 2021 18:38:03 +0000) ---
Andreas Dilger (adilger@whamcloud.com) uploaded a new patch: https://review.whamcloud.com/41178

Subject: LU-14055 obdclass: move obd_debugfs_vars to end obd_device

Project: fs/lustre-release

Branch: master

Current Patch Set: 1

Commit: dd0a0df383387e6455bbad565503883433516454

--- Comment (sihara, Fri, 8 Jan 2021 05:33:30 +0000) ---
Andreas, 

 I just tested two patches, but the performrance was even worse below.

access    bw(MiB/s)  IOPS       Latency(s)  block(KiB) xfer(KiB)  open(s)    wr/rd(s)   close(s)   total(s)   iter
------    ---------  ----       ----------  ---------- ---------  --------   --------   --------   --------   ----
write     14218      888.67     161.01      16384      16384      0.159725   172.84     27.90      172.85     0   
write     14168      885.51     159.56      16384      16384      0.218456   173.46     23.85      173.46     0   
write     14093      880.82     161.54      16384      16384      0.191401   174.38     25.50      174.38     0

--- Comment (adilger, Thu, 7 Jan 2021 20:13:49 +0000) ---
John, it is on the client only, AFAIK. 

Shuichi, could you please run "pahole" on the obdclass.ko module with and without the problem and attach it here. That program is part of the "dwarves RPM.

--- Comment (jhammond, Thu, 7 Jan 2021 16:46:13 +0000) ---
I cannot tell if this is already understood but it would be useful to know if the change in performance is due to the debugfs changes being applied to the client, to the server, or both.

--- Comment (adilger, Thu, 7 Jan 2021 14:33:00 +0000) ---
Shuichi, could you please try with these two patches. The first one just decreases the struct size by 4 bytes, but I'm not sure if that will be enough. The second reduces it by over 2KB, which hopefully is enough. Otherwise, it may be that there is an alignment issue with some struct (likely the new "obd_k*" ones at the end) that will need some specific alignment requests.

--- Comment (gerrit, Thu, 7 Jan 2021 13:23:18 +0000) ---
Andreas Dilger (adilger@whamcloud.com) uploaded a new patch: https://review.whamcloud.com/41162

Subject: LU-14055 lmv: reduce struct lmv_obd size

Project: fs/lustre-release

Branch: master

Current Patch Set: 1

Commit: 4f6159a3f2175cdcb8eee4017ba8e0a3d70268f2

--- Comment (gerrit, Thu, 7 Jan 2021 13:23:17 +0000) ---
Andreas Dilger (adilger@whamcloud.com) uploaded a new patch: https://review.whamcloud.com/41161

Subject: LU-14055 obdclass: fill hole in struct obd_device

Project: fs/lustre-release

Branch: master

Current Patch Set: 1

Commit: 29898c50da924ad146b71046ee066371058cbb6a

--- Comment (adilger, Thu, 7 Jan 2021 08:41:20 +0000) ---
As for fields that might be affected by the addition of obd_debugfs_vars there are only a few that are after this new field, and of those only a subset are used on the client:

        /* --- cacheline 101 boundary (6464 bytes) --- */                       
        struct ldebugfs_vars *     obd_debugfs_vars;     /*  6464     8 */      
        atomic_t                   obd_evict_inprogress; /*  6472     4 */      
                                                                                
        /* XXX 4 bytes hole, try to pack */                                     
                                                                                
        wait_queue_head_t          obd_evict_inprogress_waitq; /*  6480    24 */
        struct list_head           obd_evict_list;       /*  6504    16 */      
        rwlock_t                   obd_pool_lock;        /*  6520     8 */      
        /* --- cacheline 102 boundary (6528 bytes) --- */                       
        __u64                      obd_pool_slv;         /*  6528     8 */      
        int                        obd_pool_limit;       /*  6536     4 */      
        int                        obd_conn_inprogress;  /*  6540     4 */      
        struct lu_ref              obd_reference;        /*  6544     0 */      
        struct kset                obd_kset;             /*  6544   160 */      
        /* --- cacheline 104 boundary (6656 bytes) was 48 bytes ago --- */      
        struct kobj_type           obd_ktype;            /*  6704    72 */      
        /* --- cacheline 105 boundary (6720 bytes) was 56 bytes ago --- */      
        struct completion          obd_kobj_unregister;  /*  6776    32 */

Likely candidates might be obd_pool_slv being split from obd_pool_lock, or something in the recently-added obd_kset or obd_ktype fields.  I'm hoping that shrinking obd_device will resolve the problem, since random field alignment issues causing such huge performance swings is a nightmare.

--- Comment (adilger, Thu, 7 Jan 2021 07:59:12 +0000) ---
Very strange that adding an 8-byte pointer to the already-large struct obd_device causes such a huge performance problem. According to pahole:

        /* size: 6808, cachelines: 107, members: 98 */
        /* sum members: 6792, holes: 2, sum holes: 8 */
        /* sum bitfield members: 20 bits, bit holes: 1, sum bit holes: 44 bits */
        /* paddings: 2, sum paddings: 8 */
        /* forced alignments: 1 */
        /* last cacheline: 24 bytes */
} __attribute__((__aligned__(8)));

Maybe it pushes the struct from 106 cachelines to 107, but I wouldn't think that would make a huge difference in performance. We could pack the two 4-byte holes in the struct to get back 8 bytes to solve this problem quickly before 2.14. That means the next patch that touches this struct is going to cause problems again, but would also give us some breathing room to resolve this issue more completely in 2.15. I will make a patch for this.

pahole shows a number of other major offenders in the struct that could be cleaned up:

        struct rhashtable          obd_uuid_hash;        /*   200   176 */
        struct rhltable            obd_nid_hash;         /*   376   176 */
 
        struct obd_llog_group      obd_olg;              /*   936   176 */

        struct hrtimer             obd_recovery_timer __attribute__((__aligned__
(8))); /*  1272    80 */

        union {
                struct obd_device_target obt;            /*  1520    96 */
                struct filter_obd  filter;               /*  1520    96 */
                struct ost_obd     ost;                  /*  1520    72 */
                struct echo_obd    echo;                 /*  1520   336 */
                struct client_obd  cli;                  /*  1520  2664 */
                struct echo_client_obd echo_client;      /*  1520    56 */
                struct lov_obd     lov;                  /*  1520   680 */
                struct lmv_obd     lmv;                  /*  1520  4872 */
        } u;                                             /*  1520  4872 */

There seems to have been a lot of cruft added to obd_device over the years that is server-specific and could be moved into struct obd_device_target instead of being kept in the common struct:

	obd_nid_hash usage is already under HAVE_SERVER_SUPPORT and could be declared that way also.  I have a patch for this.  Moving it into obd_device_target would be better since it would also reduce memory usage on clients that are built with server support.

	obd_uuid_hash entry is also only needed on the server. While it is referenced by __class_new_export() (also used on the client for "self" exports), it should only really be needed for targets that add remote connections. The whole block that checks obd_uuid_equals(cluuid, obd_uuid) could be under HAVE_SERVER_SUPPORT to allow obd_uuid_hash to also be moved into obd_device_target, along with obd_uuid_add() and obd_uuid_del(). I have a patch for this.

