Change:     52203
Subject:    LU-17063 osc: remove duplicate info
Link:       https://review.whamcloud.com/c/fs/lustre-release/+/52203
Change-Id:  If9f2ea5abfe1da6e586072f22c5e0758988b7760
Project:    fs/lustre-release
Branch:     master
Status:     NEW
Owner:      Patrick Farrell
Created:    2023-08-31 19:51:16.000000000
Updated:    2025-11-17 08:58:12.000000000
Patch Set:  18
Insertions: +33
Deletions:  -43
Comments:   36 (2 unresolved)

--- Labels ---
  Code-Review: (no votes)
  Verified: jenkins: +1; Maloo: -1

--- Reviewers ---
  REVIEWER: Andreas Dilger, Sebastien Buisson, Shaun Tancheff, Patrick Farrell

--- Commit Message ---
LU-17063 osc: remove duplicate info

The from/to in osc_page replicate the info provided by
oap_page_off and oap_count in osc_async_page, so just use
those.

Getting the full benefit of this requires removing the
padding, but with that done, this gets us a full 8 bytes
of size reduction in osc_page (and therefore cl_page)
size.

Signed-off-by: Patrick Farrell <pfarrell@whamcloud.com>
Change-Id: If9f2ea5abfe1da6e586072f22c5e0758988b7760

--- Review History ---

--- Message (Patrick Farrell, 2023-08-31 19:51:16.000000000) ---
Uploaded patch set 1.

--- Message (Lustre Gerrit Janitor, 2023-08-31 19:53:00.000000000) ---
Patch Set 1:

Builds for x86_64 centos7,rhel8.5 successful
Job output URL: https://testing.whamcloud.com/gerrit-janitor/34241/results.html

 Commencing initial testing: runtests@ldiskfs+DNE runtests-ssk@ldiskfs+SharedKey runtests@zfs

--- Message (Lustre Gerrit Janitor, 2023-09-01 02:11:55.000000000) ---
Patch Set 1:

Testing has completed with errors!
IMPORTANT: these tests appear to be new failures unique to this patch
- sanity2@ldiskfs+DNE:test_100(Seen in reviews: 51414 49993 49976 45616)


> sanity2@ldiskfs+DNE Failure(8979s)
- 63a(failed grant check: client:565837824 server:75661312) 100(test_100 failed with 1) 

Tests with NEW Warning messages:
- sanity2@ldiskfs+DNE(Client: RCU stall) 

Succeeded:
- conf-sanity1@ldiskfs+DNE conf-sanity2@ldiskfs+DNE conf-sanity3@ldiskfs+DNE conf-sanity-slow@ldiskfs+DNE conf-sanity-slow-106@ldiskfs+DNE conf-sanity1@zfs conf-sanity2@zfs conf-sanity3@zfs conf-sanity-slow@zfs conf-sanity-slow-106@zfs insanity@ldiskfs+DNE insanity@zfs lnet-selftest@zfs lustre-rsync-test@ldiskfs+DNE lustre-rsync-test@zfs ost-pools@ldiskfs+DNE ost-pools@zfs pjdfstest@ldiskfs+DNE pjdfstest@zfs racer@ldiskfs+DNE racer@zfs recovery-small@ldiskfs+DNE recovery-small@zfs replay-dual@ldiskfs+DNE replay-dual@zfs replay-ost-single@ldiskfs+DNE replay-ost-single@zfs replay-single@ldiskfs+DNE replay-single@zfs replay-vbr@ldiskfs+DNE replay-vbr@zfs sanity1@ldiskfs+DNE sanity-slow@ldiskfs+DNE sanity1@zfs sanity2@zfs sanity-slow@zfs sanity-benchmark@ldiskfs+DNE sanity-benchmark@zfs sanity-dom@ldiskfs+DNE sanity-dom@zfs sanity-flr@ldiskfs+DNE sanity-flr@zfs sanity-hsm@ldiskfs+DNE sanity-hsm@zfs sanity-lfsck@ldiskfs+DNE sanity-lfsck@zfs sanity-lnet@zfs sanity-pcc@ldiskfs+DNE sanity-pcc@zfs sanity-pfl@ldiskfs+DNE sanity-pfl@zfs sanity-quota@ldiskfs+DNE sanity-quota@zfs sanity-scrub@ldiskfs+DNE sanity-scrub@zfs sanity-sec@ldiskfs+DNE sanity-sec@zfs sanityn@ldiskfs+DNE sanityn@zfs 

(centos7)All results and logs: https://testing.whamcloud.com/gerrit-janitor/34241/results.html

--- Message (Maloo, 2023-09-01 02:33:05.000000000) ---
Patch Set 1:

Failed enforced test review-ldiskfs on RHEL 8.8/x86_64 uploaded by Onyx Autotest 2 from onyx-25vm1: https://testing.whamcloud.com/test_sessions/86598138-78ed-408e-89d4-4f5401cfad57 ran 5 tests.  1 tests failed: sanity.

--- Message (Maloo, 2023-09-01 03:23:47.000000000) ---
Patch Set 1:

Failed optional test review-dne-part-9 on RHEL 8.8/x86_64 uploaded by Trevis Autotest from trevis-99vm1: https://testing.whamcloud.com/test_sessions/66b53380-3b36-4dae-ac88-9544094268ca ran 7 tests.  1 tests failed: performance-sanity.

--- Message (Maloo, 2023-09-01 06:06:13.000000000) ---
Patch Set 1: Verified-1

Passed enforced test review-dne-part-3 on RHEL 8.8/x86_64 uploaded by Trevis Autotest from trevis-131vm1: https://testing.whamcloud.com/test_sessions/85f0e7e6-ea08-4929-8559-dc7e44194127 ran 3 tests.

--- Message (Patrick Farrell, 2023-09-01 14:44:45.000000000) ---
Patch Set 1:

So I'm not a master of packing behavior, but I did check pahole and we *do* only get a benefit if the padding is removed.  (I did specifically check that.)

osc_page starts at 128 bytes.

Here's what osc_page and osc_async_page look like before the patch entirely:
struct osc_page {
        struct cl_page_slice       ops_cl;               /*     0    16 */
        struct osc_async_page      ops_oap;              /*    16    92 */
        /* --- cacheline 1 boundary (64 bytes) was 44 bytes ago --- */
        unsigned int               ops_from:12;          /*   108: 0  4 */
        unsigned int               ops_to:12;            /*   108:12  4 */
        unsigned int               ops_transfer_pinned:1; /*   108:24  4 */
        unsigned int               ops_in_lru:1;         /*   108:25  4 */
        unsigned int               ops_srvlock:1;        /*   108:26  4 */
        unsigned int               ops_intree:1;         /*   108:27  4 */

        /* XXX 4 bits hole, try to pack */

        struct list_head           ops_lru;              /*   112    16 */

        /* size: 128, cachelines: 2, members: 9 */
        /* sum members: 124 */
        /* sum bitfield members: 28 bits, bit holes: 1, sum bit holes: 4 bits */
};

struct osc_async_page {
        short unsigned int         oap_page_off;         /*     0     2 */

        /* Bitfield combined with previous fields */

        unsigned int               oap_cmd:2;            /*     0:16  4 */
        enum oap_async_flags       oap_async_flags:4;    /*     0:18  4 */
        unsigned int               oap_padding1:10;      /*     0:22  4 */
        unsigned int               oap_padding2;         /*     4     4 */
        struct list_head           oap_pending_item;     /*     8    16 */
        struct list_head           oap_rpc_item;         /*    24    16 */
        loff_t                     oap_obj_off;          /*    40     8 */
        struct ptlrpc_request *    oap_request;          /*    48     8 */
        struct osc_object *        oap_obj;              /*    56     8 */
        /* --- cacheline 1 boundary (64 bytes) --- */
        struct brw_page            oap_brw_page;         /*    64    28 */

        /* size: 92, cachelines: 2, members: 11 */
        /* last cacheline: 28 bytes */
} __attribute__((__packed__));


Here's what happens if you just remove from/to - 3 bytes of hole in osc_page:

struct osc_page {
        struct cl_page_slice       ops_cl;               /*     0    16 */
        struct osc_async_page      ops_oap;              /*    16    92 */
        /* --- cacheline 1 boundary (64 bytes) was 44 bytes ago --- */
        unsigned char              ops_transfer_pinned:1; /*   108: 0  1 */
        unsigned char              ops_in_lru:1;         /*   108: 1  1 */
        unsigned char              ops_srvlock:1;        /*   108: 2  1 */
        unsigned char              ops_intree:1;         /*   108: 3  1 */

        /* XXX 4 bits hole, try to pack */
        /* XXX 3 bytes hole, try to pack */

        struct list_head           ops_lru;              /*   112    16 */

        /* size: 128, cachelines: 2, members: 7 */
        /* sum members: 124, holes: 1, sum holes: 3 */
        /* sum bitfield members: 4 bits, bit holes: 1, sum bit holes: 4 bits */
};

(osc_async_page is unchanged)

Here's what happens if you JUST remove the padding (so, from/to are still there):

struct osc_page {
        struct cl_page_slice       ops_cl;               /*     0    16 */
        struct osc_async_page      ops_oap;              /*    16    87 */

        /* XXX 1 byte hole, try to pack */

        /* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
        unsigned int               ops_from:12;          /*   104: 0  4 */
        unsigned int               ops_to:12;            /*   104:12  4 */
        unsigned int               ops_transfer_pinned:1; /*   104:24  4 */
        unsigned int               ops_in_lru:1;         /*   104:25  4 */
        unsigned int               ops_srvlock:1;        /*   104:26  4 */
        unsigned int               ops_intree:1;         /*   104:27  4 */

        /* XXX 4 bits hole, try to pack */
        /* XXX 4 bytes hole, try to pack */

        struct list_head           ops_lru;              /*   112    16 */

        /* size: 128, cachelines: 2, members: 9 */
        /* sum members: 119, holes: 2, sum holes: 5 */
        /* sum bitfield members: 28 bits, bit holes: 1, sum bit holes: 4 bits */
};

truct osc_async_page {
        short unsigned int         oap_page_off;         /*     0     2 */

        /* Bitfield combined with previous fields */

        unsigned int               oap_cmd:2;            /*     0:16  4 */
        enum oap_async_flags       oap_async_flags:4;    /*     0:18  4 */

        /* XXX 2 bits hole, try to pack */
        /* Bitfield combined with next fields */

        struct list_head           oap_pending_item;     /*     3    16 */
        struct list_head           oap_rpc_item;         /*    19    16 */
        loff_t                     oap_obj_off;          /*    35     8 */
        struct ptlrpc_request *    oap_request;          /*    43     8 */
        struct osc_object *        oap_obj;              /*    51     8 */
        struct brw_page            oap_brw_page;         /*    59    28 */

        /* size: 87, cachelines: 2, members: 9 */
        /* sum members: 86 */
        /* sum bitfield members: 6 bits, bit holes: 1, sum bit holes: 2 bits */
        /* last cacheline: 23 bytes */
} __attribute__((__packed__));


And here's what happens if you remove from/to and the padding:

struct osc_page {
        struct cl_page_slice       ops_cl;               /*     0    16 */
        struct osc_async_page      ops_oap;              /*    16    87 */
        /* --- cacheline 1 boundary (64 bytes) was 39 bytes ago --- */
        unsigned char              ops_transfer_pinned:1; /*   103: 0  1 */
        unsigned char              ops_in_lru:1;         /*   103: 1  1 */
        unsigned char              ops_srvlock:1;        /*   103: 2  1 */
        unsigned char              ops_intree:1;         /*   103: 3  1 */

        /* XXX 4 bits hole, try to pack */

        struct list_head           ops_lru;              /*   104    16 */

        /* size: 120, cachelines: 2, members: 7 */
        /* sum members: 119 */
        /* sum bitfield members: 4 bits, bit holes: 1, sum bit holes: 4 bits */
        /* last cacheline: 56 bytes */
};

struct osc_async_page {
        short unsigned int         oap_page_off;         /*     0     2 */

        /* Bitfield combined with previous fields */

        unsigned int               oap_cmd:2;            /*     0:16  4 */
        enum oap_async_flags       oap_async_flags:4;    /*     0:18  4 */

        /* XXX 2 bits hole, try to pack */
        /* Bitfield combined with next fields */

        struct list_head           oap_pending_item;     /*     3    16 */
        struct list_head           oap_rpc_item;         /*    19    16 */
        loff_t                     oap_obj_off;          /*    35     8 */
        struct ptlrpc_request *    oap_request;          /*    43     8 */
        struct osc_object *        oap_obj;              /*    51     8 */
        struct brw_page            oap_brw_page;         /*    59    28 */

        /* size: 87, cachelines: 2, members: 9 */
        /* sum members: 86 */
        /* sum bitfield members: 6 bits, bit holes: 1, sum bit holes: 2 bits */
        /* last cacheline: 23 bytes */
} __attribute__((__packed__));

Now we're at 120 bytes.

I have to say, I'm getting a bit lost in the details even trying to follow it right now.
But removing the padding allows us to pack osc_page more tightly and it doesn't happen if we don't remove it.

--- Message (Patrick Farrell, 2023-09-08 16:45:21.000000000) ---
Patch Set 2: Patch Set 1 was rebased

--- Message (Patrick Farrell, 2023-09-08 16:46:33.000000000) ---
Patch Set 2:

Andreas,

Note I still think this is probably correct (see previous comments re pahole)

Sebastien,

I think this patch is valid?  But maybe not - let's see.

--- Message (Lustre Gerrit Janitor, 2023-09-08 16:46:58.000000000) ---
Patch Set 2:

Builds for x86_64 centos7,rhel8.5 successful
Job output URL: https://testing.whamcloud.com/gerrit-janitor/34680/results.html

 Commencing initial testing: runtests@ldiskfs+DNE runtests-ssk@ldiskfs+SharedKey runtests@zfs

--- Message (wc-checkpatch, 2023-09-08 16:50:02.000000000) ---
Patch Set 2:

Looks good to me.

--- Message (Lustre Gerrit Janitor, 2023-09-08 16:58:21.000000000) ---
Patch Set 2:

Initial testing succeeded.

Succeeded:
- runtests@ldiskfs+DNE runtests-ssk@ldiskfs+SharedKey runtests@zfs 

(centos7)All results and logs: https://testing.whamcloud.com/gerrit-janitor/34680/results.html
Commencing standard testing: 
- conf-sanity1@ldiskfs+DNE conf-sanity2@ldiskfs+DNE conf-sanity3@ldiskfs+DNE conf-sanity-slow@ldiskfs+DNE conf-sanity-slow-106@ldiskfs+DNE conf-sanity1@zfs conf-sanity2@zfs conf-sanity3@zfs conf-sanity-slow@zfs conf-sanity-slow-106@zfs insanity@ldiskfs+DNE insanity@zfs lnet-selftest@zfs lustre-rsync-test@ldiskfs+DNE lustre-rsync-test@zfs ost-pools@ldiskfs+DNE ost-pools@zfs pjdfstest@ldiskfs+DNE pjdfstest@zfs racer@ldiskfs+DNE racer@zfs recovery-small@ldiskfs+DNE recovery-small@zfs replay-dual@ldiskfs+DNE replay-dual@zfs replay-ost-single@ldiskfs+DNE replay-ost-single@zfs replay-single@ldiskfs+DNE replay-single@zfs replay-vbr@ldiskfs+DNE replay-vbr@zfs sanity1@ldiskfs+DNE sanity2@ldiskfs+DNE sanity-slow@ldiskfs+DNE sanity1@zfs sanity2@zfs sanity-slow@zfs sanity-benchmark@ldiskfs+DNE sanity-benchmark@zfs sanity-dom@ldiskfs+DNE sanity-dom@zfs sanity-flr@ldiskfs+DNE sanity-flr@zfs sanity-hsm@ldiskfs+DNE sanity-hsm@zfs sanity-lfsck@ldiskfs+DNE sanity-lfsck@zfs sanity-lnet@zfs sanity-pcc@ldiskfs+DNE sanity-pcc@zfs sanity-pfl@ldiskfs+DNE sanity-pfl@zfs sanity-quota@ldiskfs+DNE sanity-quota@zfs sanity-scrub@ldiskfs+DNE sanity-scrub@zfs sanity-sec@ldiskfs+DNE sanity-sec@zfs sanityn@ldiskfs+DNE sanityn@zfs

--- Message (jenkins, 2023-09-08 17:11:01.000000000) ---
Patch Set 2: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/97908/ : SUCCESS

--- Message (Maloo, 2023-09-08 17:11:23.000000000) ---
Patch Set 2:

The following sessions will be run for build 97908 patch 2

Enforced:
- review-ldiskfs on el8.8-x86_64/ldiskfs servers and clients
- review-zfs on el8.8-x86_64/zfs servers and clients
- review-dne-part-1 on el8.8-x86_64/ldiskfs servers and clients
- review-dne-part-2 on el8.8-x86_64/ldiskfs servers and clients
- review-dne-part-3 on el8.8-x86_64/ldiskfs servers and clients
- review-dne-part-4 on el8.8-x86_64/ldiskfs servers and clients
- review-dne-part-5 on el8.8-x86_64/ldiskfs servers and clients
- review-dne-part-6 on el8.8-x86_64/ldiskfs servers and clients
- review-dne-part-7 on el8.8-x86_64/ldiskfs servers and clients
- review-dne-zfs-part-1 on el8.8-x86_64/zfs servers and clients
- review-dne-zfs-part-2 on el8.8-x86_64/zfs servers and clients
- review-dne-zfs-part-3 on el8.8-x86_64/zfs servers and clients
- review-dne-zfs-part-4 on el8.8-x86_64/zfs servers and clients
- review-dne-zfs-part-5 on el8.8-x86_64/zfs servers and clients
- review-dne-zfs-part-6 on el8.8-x86_64/zfs servers and clients
- review-dne-zfs-part-7 on el8.8-x86_64/zfs servers and clients
- review-ldiskfs-arm on el8.8-x86_64/ldiskfs servers and el8.7-aarch64/ldiskfs clients
- review-dne-selinux-ssk-part-1 on el8.8-x86_64/ldiskfs servers and clients
- review-dne-selinux-ssk-part-2 on el8.8-x86_64/ldiskfs servers and clients
- review-ldiskfs on el8.8-x86_64/ldiskfs servers and el9.2-x86_64/ldiskfs clients

Optional:
- review-dne-part-8 on el8.8-x86_64/ldiskfs servers and clients
- review-dne-part-9 on el8.8-x86_64/ldiskfs servers and clients
- review-ldiskfs on el9.2-x86_64/ldiskfs servers and clients
- review-ldiskfs on el8.8-x86_64/ldiskfs servers and sles15sp4-x86_64/ldiskfs clients
- review-ldiskfs-ubuntu on el8.8-x86_64/ldiskfs servers and ubuntu2204-x86_64/ldiskfs clients

Maloo Test Queue: https://testing.whamcloud.com/test_queue?jobs=lustre-reviews&builds=97908&commit=Apply+Filter
Maloo Results: https://testing.whamcloud.com/test_sessions/related?jobs=lustre-reviews&builds=97908#redirect

--- Message (Lustre Gerrit Janitor, 2023-09-08 19:38:14.000000000) ---
Patch Set 2:

Testing has completed with errors!

> sanity-scrub@ldiskfs+DNE Timeout(2409s)
> sanityn@ldiskfs+DNE Timeout(5510s)

Succeeded:
- conf-sanity1@ldiskfs+DNE conf-sanity2@ldiskfs+DNE conf-sanity3@ldiskfs+DNE conf-sanity-slow@ldiskfs+DNE conf-sanity-slow-106@ldiskfs+DNE conf-sanity1@zfs conf-sanity2@zfs conf-sanity3@zfs conf-sanity-slow@zfs conf-sanity-slow-106@zfs insanity@ldiskfs+DNE insanity@zfs lnet-selftest@zfs lustre-rsync-test@ldiskfs+DNE lustre-rsync-test@zfs ost-pools@ldiskfs+DNE ost-pools@zfs pjdfstest@ldiskfs+DNE pjdfstest@zfs racer@ldiskfs+DNE racer@zfs recovery-small@ldiskfs+DNE recovery-small@zfs replay-dual@ldiskfs+DNE replay-dual@zfs replay-ost-single@ldiskfs+DNE replay-ost-single@zfs replay-single@ldiskfs+DNE replay-single@zfs replay-vbr@ldiskfs+DNE replay-vbr@zfs sanity1@ldiskfs+DNE sanity2@ldiskfs+DNE sanity-slow@ldiskfs+DNE sanity1@zfs sanity2@zfs sanity-slow@zfs sanity-benchmark@ldiskfs+DNE sanity-benchmark@zfs sanity-dom@ldiskfs+DNE sanity-dom@zfs sanity-flr@ldiskfs+DNE sanity-flr@zfs sanity-hsm@ldiskfs+DNE sanity-hsm@zfs sanity-lfsck@ldiskfs+DNE sanity-lfsck@zfs sanity-lnet@zfs sanity-pcc@ldiskfs+DNE sanity-pcc@zfs sanity-pfl@ldiskfs+DNE sanity-pfl@zfs sanity-quota@ldiskfs+DNE sanity-quota@zfs sanity-scrub@zfs sanity-sec@ldiskfs+DNE sanity-sec@zfs sanityn@zfs 

(centos7)All results and logs: https://testing.whamcloud.com/gerrit-janitor/34680/results.html

--- Message (Maloo, 2023-09-08 19:59:32.000000000) ---
Patch Set 2:

Failed optional test review-dne-part-9 on RHEL 8.8/x86_64 uploaded by Onyx Autotest from onyx-75vm11: https://testing.whamcloud.com/test_sessions/fa9addf6-edec-48a0-962c-aeb8258ed08e ran 7 tests.  1 tests failed: parallel-scale-nfsv3.

--- Message (Maloo, 2023-09-08 22:18:05.000000000) ---
Patch Set 2:

Failed enforced test review-dne-zfs-part-4 on RHEL 8.8/x86_64 uploaded by Onyx Autotest from onyx-109vm5: https://testing.whamcloud.com/test_sessions/10ac4e0e-37a2-468f-9f48-b7fccb42061f ran 9 tests.  1 tests failed: sanity-quota.

--- Message (Maloo, 2023-09-08 23:02:56.000000000) ---
Patch Set 2:

Failed enforced test review-ldiskfs on RHEL 8.8/x86_64 uploaded by Onyx Autotest from onyx-72vm8: https://testing.whamcloud.com/test_sessions/5957eb0a-d694-43a3-a5eb-65ff8635b70c ran 5 tests.  1 tests failed: sanity-lnet.

--- Message (Maloo, 2023-09-09 00:06:39.000000000) ---
Patch Set 2:

Failed optional test review-ldiskfs-ubuntu on RHEL 8.8/x86_64, Ubuntu 22.04/x86_64 uploaded by Onyx Autotest from onyx-65vm1: https://testing.whamcloud.com/test_sessions/3a43931f-b652-4316-b421-35e06667a719 ran 6 tests.  1 tests failed: sanity.

--- Message (Maloo, 2023-09-09 02:06:30.000000000) ---
Patch Set 2: Verified-1

Failed enforced test review-ldiskfs-arm on RHEL 8.7/aarch64, RHEL 8.8/x86_64 uploaded by Trevis Autotest from trevis-108vm13: https://testing.whamcloud.com/test_sessions/a01dabd1-d05d-4158-9fb1-21e758262adf ran 8 tests.  2 tests failed: sanity-lnet, sanity.

--- Message (Andreas Dilger, 2023-09-09 05:38:35.000000000) ---
Patch Set 2:

I think this is doing the wrong thing because of the "packed" attribute. Look at some of the field alignments:

        struct list_head           oap_pending_item;     /*     3    16 */
        struct list_head           oap_rpc_item;         /*    19    16 */

These are 16-byte fields with two pointers in them, but they are aligned on 3- and 19-byte offsets in the struct. That seems very wrong to me.  Maybe x86_74 can handle that somehow, but I expect it is not great. 

Options would include moving the bitfields to the end of osc_async_page so they pack together with the bitfields in osc_page, and possibly adding enough bit padding to align the remaining fields on proper boundaries.

Removing the "packed" attribute would fix the alignment, but maybe increase the size.

--- Message (Patrick Farrell, 2023-09-09 22:55:26.000000000) ---
Uploaded patch set 3: Patch Set 2 was rebased.

--- Message (wc-checkpatch, 2023-09-09 23:04:29.000000000) ---
Patch Set 3:

Looks good to me.

--- Message (Lustre Gerrit Janitor, 2023-09-09 23:12:23.000000000) ---
Patch Set 3:

Builds for x86_64 centos7,rhel8.5 successful
Job output URL: https://testing.whamcloud.com/gerrit-janitor/34721/results.html

