Change:     9511
Subject:    LU-4690 lod: separate master object with master stripe
Link:       https://review.whamcloud.com/c/fs/lustre-release/+/9511
Change-Id:  I6212fb97a2360664b48e0a75424a89c857da2043
Project:    fs/lustre-release
Branch:     master
Status:     MERGED
Owner:      wangdi
Created:    2014-03-05 20:31:51.000000000
Updated:    2014-05-08 04:15:19.000000000
Patch Set:  37
Insertions: +2298
Deletions:  -1031
Comments:   418 (0 unresolved)

--- Labels ---
  Code-Review: Andreas Dilger: +1; Oleg Drokin: +2; John Hammond: +1
  Verified: Jenkins: +1; Maloo: +1

--- Reviewers ---
  REVIEWER: Jenkins, Fan Yong, wangdi, Oleg Drokin, Andreas Dilger, Alex Zhuravlev, John Hammond, Gerrit Gatekeeper, Patrick Farrell

--- Commit Message ---
LU-4690 lod: separate master object with master stripe

Separate master stripe with master object, so
1. stripeEA only exists on master object.
2. sub-stripe object will be inserted into master object
as sub-directory, and it can get the master object by "..".

By this, it will remove those specilities for stripe0 in
LMV and LOD. And also simplify LFSCK, i.e. consistency check
would be easier.

And also after this separation, LOD will know whether iterating
the whole stripe or single stripe eaisly, i.e. for master_object,
it will iterate the whole stripes, for sub_stripe, it will only
iterate the single stripe.

This patch also fixes a few things in osp orphan iteration, to
make it work with remote dir entry iteration.


Patch Set 34:

(6 comments)

I see that 9883 has been incorporated into this chnage. So I'll repeat my comment about 9883.

This may cause sanity to not fail with the LBUG from LU-4988 but I can't see how it fixes the unsafe usage pattern among lod, osp, and seq in the general case. Could you explain that?

--- Message (wangdi, 2014-05-05 16:46:29.000000000) ---
Patch Set 34:

(1 comment)

--- Message (John Hammond, 2014-05-05 17:24:31.000000000) ---
Patch Set 34:

So we use the dt interface to get permission to use the obd interface? The point of dt_statfs() is to provide file system statistics. You're confusing the point of the function with the way that it's being used. I would prefer that the check on lcs_exp be moved to osp_fid_alloc() and properly handled in lod_prep_md_striped_create().

--- Message (wangdi, 2014-05-05 18:02:51.000000000) ---
Patch Set 34:

I think we are also using dt_statfs to check the OSP status some how, instead of only statistics, if you are talking about separate the status check with retrieving statistics in dt_statfs, I am not so sure to see big benefits here. IMHO.

--- Message (Andreas Dilger, 2014-05-05 23:32:03.000000000) ---
Patch Set 34: Code-Review-1

(23 comments)

I expect this won't be the last version of this patch anyway, given that John hasn't yet approved it, so please fix up the issues below.

--- Message (John Hammond, 2014-05-06 03:03:10.000000000) ---
Patch Set 34:

As I discussed with Di, I am actually OK with this as long as an issue is created for the dt_statfs()/obd_alloc_fid() calamity. I would prefer to have it fixed now but I can live without it. (If we don't fix it then big comments in both of the OSP functions would help.) That said, Andreas' comments are also probably worth reading. Maybe.

--- Message (wangdi, 2014-05-06 05:40:03.000000000) ---
Patch Set 34:

(3 comments)

--- Message (wangdi, 2014-05-06 06:21:24.000000000) ---
Uploaded patch set 35.

--- Message (wc-checkpatch, 2014-05-06 06:22:36.000000000) ---
Patch Set 35:

(7 comments)

7 style warning(s).
For more details please see https://wiki.hpdd.intel.com/display/PUB/Coding+Guidelines

--- Message (Jenkins, 2014-05-06 10:10:43.000000000) ---
Patch Set 35:

Build Started http://build.whamcloud.com/job/lustre-reviews/23690/

--- Message (Jenkins, 2014-05-06 10:31:15.000000000) ---
Patch Set 35: Verified-1

Build Failed 
 
http://build.whamcloud.com/job/lustre-reviews/23690/ : FAILURE

--- Message (Jenkins, 2014-05-06 16:31:52.000000000) ---
Patch Set 1: -Verified

Build Started http://build.whamcloud.com/job/lustre-reviews/23702/

--- Message (John Hammond, 2014-05-06 16:49:44.000000000) ---
Patch Set 35:

Do we intent for lmv_mds_md_v1 and lmv_user_md_v1 to be the same size? And/or to have common fields at identical offsets? There are some pleces in llapi where this is assumed. It's hard to say how many other places implicityly assume this. This is not the case now.
 
struct lmv_user_md_v1 {
	__u32                      lum_magic;            /*     0     4 */
	__u32                      lum_stripe_count;     /*     4     4 */
	__u32                      lum_stripe_offset;    /*     8     4 */
	__u32                      lum_hash_type;        /*    12     4 */
	__u32                      lum_type;             /*    16     4 */
	__u32                      lum_padding1;         /*    20     4 */
	__u32                      lum_padding2;         /*    24     4 */
	__u32                      lum_padding3;         /*    28     4 */
	char                       lum_pool_name[16];    /*    32    16 */
	struct lmv_user_mds_data   lum_objects[0];       /*    48     0 */

	/* size: 48, cachelines: 1, members: 10 */
	/* last cacheline: 48 bytes */
};

struct lmv_mds_md_v1 {
	__u32                      lmv_magic;            /*     0     4 */
	__u32                      lmv_stripe_count;     /*     4     4 */
	__u32                      lmv_master_mdt_index; /*     8     4 */
	__u32                      lmv_hash_type;        /*    12     4 */
	__u32                      lmv_layout_version;   /*    16     4 */
	__u32                      lmv_padding;          /*    20     4 */
	struct lu_fid              lmv_master_fid;       /*    24    16 */
	char                       lmv_pool_name[16];    /*    40    16 */
	struct lu_fid              lmv_stripe_fids[0];   /*    56     0 */

	/* size: 56, cachelines: 1, members: 9 */
	/* last cacheline: 56 bytes */
};

--- Message (Jenkins, 2014-05-06 16:58:13.000000000) ---
Patch Set 1: Verified+1

Build Successful 
 
http://build.whamcloud.com/job/lustre-reviews/23702/ : SUCCESS

--- Message (Autotest, 2014-05-06 17:51:08.000000000) ---
Patch Set 1:

Shadow Autotest started enforced review-ldiskfs session.

--- Message (Autotest, 2014-05-06 17:51:14.000000000) ---
Patch Set 1:

Shadow Autotest started optional review-zfs session.

--- Message (Autotest, 2014-05-06 17:51:15.000000000) ---
Patch Set 1:

Shadow Autotest started enforced review-dne-part-1 session.

--- Message (wangdi, 2014-05-06 19:44:46.000000000) ---
Patch Set 35:

