Change:     52203
Subject:    LU-17063 osc: remove duplicate info
Link:       https://review.whamcloud.com/c/fs/lustre-release/+/52203
Change-Id:  If9f2ea5abfe1da6e586072f22c5e0758988b7760
Project:    fs/lustre-release
Branch:     master
Status:     NEW
Owner:      Patrick Farrell
Created:    2023-08-31 19:51:16.000000000
Updated:    2025-11-17 08:58:12.000000000
Patch Set:  18
Insertions: +33
Deletions:  -43
Comments:   36 (2 unresolved)

--- Labels ---
  Code-Review: (no votes)
  Verified: jenkins: +1; Maloo: -1

--- Reviewers ---
  REVIEWER: Andreas Dilger, Sebastien Buisson, Shaun Tancheff, Patrick Farrell

--- Commit Message ---
LU-17063 osc: remove duplicate info

The from/to in osc_page replicate the info provided by
oap_page_off and oap_count in osc_async_page, so just use
those.

Getting the full benefit of this requires removing the
padding, but with that done, this gets us a full 8 bytes
of size reduction in osc_page (and therefore cl_page)
size.

Signed-off-by: Patrick Farrell <pfarrell@whamcloud.com>
Change-Id: If9f2ea5abfe1da6e586072f22c5e0758988b7760

--- Review History ---

--- Message (Patrick Farrell, 2023-08-31 19:51:16.000000000) ---
Uploaded patch set 1.

--- Message (wc-checkpatch, 2023-08-31 19:54:16.000000000) ---
Patch Set 1:

Looks good to me.

--- Message (Andreas Dilger, 2023-08-31 22:27:06.000000000) ---
Patch Set 1: Code-Review-1

(2 comments)

Sorry, I don't think the struct changes make sense.  Please generate "pahole" output from before/after this patch for osc_page and osc_async_page to see what this is actually doing.

--- Message (jenkins, 2023-08-31 22:32:14.000000000) ---
Patch Set 1: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/97524/ : SUCCESS

--- Message (Patrick Farrell, 2023-09-01 14:44:45.000000000) ---
Patch Set 1:

So I'm not a master of packing behavior, but I did check pahole and we *do* only get a benefit if the padding is removed.  (I did specifically check that.)

osc_page starts at 128 bytes.

Here's what osc_page and osc_async_page look like before the patch entirely:
struct osc_page {
        struct cl_page_slice       ops_cl;               /*     0    16 */
        struct osc_async_page      ops_oap;              /*    16    92 */
        /* --- cacheline 1 boundary (64 bytes) was 44 bytes ago --- */
        unsigned int               ops_from:12;          /*   108: 0  4 */
        unsigned int               ops_to:12;            /*   108:12  4 */
        unsigned int               ops_transfer_pinned:1; /*   108:24  4 */
        unsigned int               ops_in_lru:1;         /*   108:25  4 */
        unsigned int               ops_srvlock:1;        /*   108:26  4 */
        unsigned int               ops_intree:1;         /*   108:27  4 */

        /* XXX 4 bits hole, try to pack */

        struct list_head           ops_lru;              /*   112    16 */

        /* size: 128, cachelines: 2, members: 9 */
        /* sum members: 124 */
        /* sum bitfield members: 28 bits, bit holes: 1, sum bit holes: 4 bits */
};

struct osc_async_page {
        short unsigned int         oap_page_off;         /*     0     2 */

        /* Bitfield combined with previous fields */

        unsigned int               oap_cmd:2;            /*     0:16  4 */
        enum oap_async_flags       oap_async_flags:4;    /*     0:18  4 */
        unsigned int               oap_padding1:10;      /*     0:22  4 */
        unsigned int               oap_padding2;         /*     4     4 */
        struct list_head           oap_pending_item;     /*     8    16 */
        struct list_head           oap_rpc_item;         /*    24    16 */
        loff_t                     oap_obj_off;          /*    40     8 */
        struct ptlrpc_request *    oap_request;          /*    48     8 */
        struct osc_object *        oap_obj;              /*    56     8 */
        /* --- cacheline 1 boundary (64 bytes) --- */
        struct brw_page            oap_brw_page;         /*    64    28 */

        /* size: 92, cachelines: 2, members: 11 */
        /* last cacheline: 28 bytes */
} __attribute__((__packed__));


Here's what happens if you just remove from/to - 3 bytes of hole in osc_page:

struct osc_page {
        struct cl_page_slice       ops_cl;               /*     0    16 */
        struct osc_async_page      ops_oap;              /*    16    92 */
        /* --- cacheline 1 boundary (64 bytes) was 44 bytes ago --- */
        unsigned char              ops_transfer_pinned:1; /*   108: 0  1 */
        unsigned char              ops_in_lru:1;         /*   108: 1  1 */
        unsigned char              ops_srvlock:1;        /*   108: 2  1 */
        unsigned char              ops_intree:1;         /*   108: 3  1 */

        /* XXX 4 bits hole, try to pack */
        /* XXX 3 bytes hole, try to pack */

        struct list_head           ops_lru;              /*   112    16 */

        /* size: 128, cachelines: 2, members: 7 */
        /* sum members: 124, holes: 1, sum holes: 3 */
        /* sum bitfield members: 4 bits, bit holes: 1, sum bit holes: 4 bits */
};

(osc_async_page is unchanged)

Here's what happens if you JUST remove the padding (so, from/to are still there):

struct osc_page {
        struct cl_page_slice       ops_cl;               /*     0    16 */
        struct osc_async_page      ops_oap;              /*    16    87 */

        /* XXX 1 byte hole, try to pack */

        /* --- cacheline 1 boundary (64 bytes) was 40 bytes ago --- */
        unsigned int               ops_from:12;          /*   104: 0  4 */
        unsigned int               ops_to:12;            /*   104:12  4 */
        unsigned int               ops_transfer_pinned:1; /*   104:24  4 */
        unsigned int               ops_in_lru:1;         /*   104:25  4 */
        unsigned int               ops_srvlock:1;        /*   104:26  4 */
        unsigned int               ops_intree:1;         /*   104:27  4 */

        /* XXX 4 bits hole, try to pack */
        /* XXX 4 bytes hole, try to pack */

        struct list_head           ops_lru;              /*   112    16 */

        /* size: 128, cachelines: 2, members: 9 */
        /* sum members: 119, holes: 2, sum holes: 5 */
        /* sum bitfield members: 28 bits, bit holes: 1, sum bit holes: 4 bits */
};

truct osc_async_page {
        short unsigned int         oap_page_off;         /*     0     2 */

        /* Bitfield combined with previous fields */

        unsigned int               oap_cmd:2;            /*     0:16  4 */
        enum oap_async_flags       oap_async_flags:4;    /*     0:18  4 */

        /* XXX 2 bits hole, try to pack */
        /* Bitfield combined with next fields */

        struct list_head           oap_pending_item;     /*     3    16 */
        struct list_head           oap_rpc_item;         /*    19    16 */
        loff_t                     oap_obj_off;          /*    35     8 */
        struct ptlrpc_request *    oap_request;          /*    43     8 */
        struct osc_object *        oap_obj;              /*    51     8 */
        struct brw_page            oap_brw_page;         /*    59    28 */

        /* size: 87, cachelines: 2, members: 9 */
        /* sum members: 86 */
        /* sum bitfield members: 6 bits, bit holes: 1, sum bit holes: 2 bits */
        /* last cacheline: 23 bytes */
} __attribute__((__packed__));


And here's what happens if you remove from/to and the padding:

struct osc_page {
        struct cl_page_slice       ops_cl;               /*     0    16 */
        struct osc_async_page      ops_oap;              /*    16    87 */
        /* --- cacheline 1 boundary (64 bytes) was 39 bytes ago --- */
        unsigned char              ops_transfer_pinned:1; /*   103: 0  1 */
        unsigned char              ops_in_lru:1;         /*   103: 1  1 */
        unsigned char              ops_srvlock:1;        /*   103: 2  1 */
        unsigned char              ops_intree:1;         /*   103: 3  1 */

        /* XXX 4 bits hole, try to pack */

        struct list_head           ops_lru;              /*   104    16 */

        /* size: 120, cachelines: 2, members: 7 */
        /* sum members: 119 */
        /* sum bitfield members: 4 bits, bit holes: 1, sum bit holes: 4 bits */
        /* last cacheline: 56 bytes */
};

struct osc_async_page {
        short unsigned int         oap_page_off;         /*     0     2 */

        /* Bitfield combined with previous fields */

        unsigned int               oap_cmd:2;            /*     0:16  4 */
        enum oap_async_flags       oap_async_flags:4;    /*     0:18  4 */

        /* XXX 2 bits hole, try to pack */
        /* Bitfield combined with next fields */

        struct list_head           oap_pending_item;     /*     3    16 */
        struct list_head           oap_rpc_item;         /*    19    16 */
        loff_t                     oap_obj_off;          /*    35     8 */
        struct ptlrpc_request *    oap_request;          /*    43     8 */
        struct osc_object *        oap_obj;              /*    51     8 */
        struct brw_page            oap_brw_page;         /*    59    28 */

        /* size: 87, cachelines: 2, members: 9 */
        /* sum members: 86 */
        /* sum bitfield members: 6 bits, bit holes: 1, sum bit holes: 2 bits */
        /* last cacheline: 23 bytes */
} __attribute__((__packed__));

Now we're at 120 bytes.

I have to say, I'm getting a bit lost in the details even trying to follow it right now.
But removing the padding allows us to pack osc_page more tightly and it doesn't happen if we don't remove it.

--- Message (Patrick Farrell, 2023-09-08 16:45:21.000000000) ---
Patch Set 2: Patch Set 1 was rebased

--- Message (Patrick Farrell, 2023-09-08 16:46:33.000000000) ---
Patch Set 2:

Andreas,

Note I still think this is probably correct (see previous comments re pahole)

Sebastien,

I think this patch is valid?  But maybe not - let's see.

--- Message (wc-checkpatch, 2023-09-08 16:50:02.000000000) ---
Patch Set 2:

Looks good to me.

--- Message (jenkins, 2023-09-08 17:11:01.000000000) ---
Patch Set 2: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/97908/ : SUCCESS

--- Message (Andreas Dilger, 2023-09-09 05:38:35.000000000) ---
Patch Set 2:

I think this is doing the wrong thing because of the "packed" attribute. Look at some of the field alignments:

        struct list_head           oap_pending_item;     /*     3    16 */
        struct list_head           oap_rpc_item;         /*    19    16 */

These are 16-byte fields with two pointers in them, but they are aligned on 3- and 19-byte offsets in the struct. That seems very wrong to me.  Maybe x86_74 can handle that somehow, but I expect it is not great. 

Options would include moving the bitfields to the end of osc_async_page so they pack together with the bitfields in osc_page, and possibly adding enough bit padding to align the remaining fields on proper boundaries.

Removing the "packed" attribute would fix the alignment, but maybe increase the size.

--- Message (Patrick Farrell, 2023-09-09 22:55:26.000000000) ---
Uploaded patch set 3: Patch Set 2 was rebased.

--- Message (wc-checkpatch, 2023-09-09 23:04:29.000000000) ---
Patch Set 3:

Looks good to me.

--- Message (jenkins, 2023-09-09 23:25:06.000000000) ---
Patch Set 3: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/97925/ : SUCCESS

--- Message (Patrick Farrell, 2023-09-10 16:52:56.000000000) ---
Uploaded patch set 4.

--- Message (Patrick Farrell, 2023-09-10 16:59:21.000000000) ---
Patch Set 4:

(1 comment)

--- Message (wc-checkpatch, 2023-09-10 17:04:11.000000000) ---
Patch Set 4:

Looks good to me.

--- Message (jenkins, 2023-09-10 17:22:56.000000000) ---
Patch Set 4: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/98014/ : SUCCESS

--- Message (Andreas Dilger, 2023-09-10 17:26:13.000000000) ---
Patch Set 4:

(2 comments)

--- Message (Patrick Farrell, 2023-09-10 17:50:52.000000000) ---
Uploaded patch set 5.

--- Message (Patrick Farrell, 2023-09-10 17:51:49.000000000) ---
Patch Set 5:

OK, yeah - I see it now; I had checked pahole but had missed that.  ((packed)) is needed to pack with the adjacent struct.

Check out this one - I think this is finally completely packed.

--- Message (wc-checkpatch, 2023-09-10 17:54:45.000000000) ---
Patch Set 5:

(2 comments)

2 style warning(s).
For more details please see http://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (Andreas Dilger, 2023-09-10 18:18:50.000000000) ---
Patch Set 5: Code-Review+1

It looks fine, but more importantly *is* it OK?

--- Message (jenkins, 2023-09-10 18:23:31.000000000) ---
Patch Set 5: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/98028/ : SUCCESS

--- Message (Patrick Farrell, 2023-09-13 15:15:41.000000000) ---
Uploaded patch set 6: New patch set was added with same tree, parent, and commit message as Patch Set 5.

--- Message (wc-checkpatch, 2023-09-13 15:19:45.000000000) ---
Patch Set 6:

(2 comments)

2 style warning(s).
For more details please see http://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (jenkins, 2023-09-13 15:43:33.000000000) ---
Patch Set 6:

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/98248/ : SUCCESS

--- Message (Patrick Farrell, 2023-09-14 16:19:23.000000000) ---
Uploaded patch set 7: New patch set was added with same tree, parent, and commit message as Patch Set 6.

--- Message (wc-checkpatch, 2023-09-14 16:25:50.000000000) ---
Patch Set 7:

(2 comments)

2 style warning(s).
For more details please see http://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (jenkins, 2023-09-14 17:06:23.000000000) ---
Patch Set 7:

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/98305/ : SUCCESS

--- Message (Patrick Farrell, 2023-09-17 18:12:42.000000000) ---
Uploaded patch set 8: Patch Set 7 was rebased.

--- Message (wc-checkpatch, 2023-09-17 18:13:02.000000000) ---
Patch Set 8:

(2 comments)

2 style warning(s).
For more details please see http://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (jenkins, 2023-09-17 18:42:57.000000000) ---
Patch Set 8: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/98580/ : SUCCESS

--- Message (Sebastien Buisson, 2023-09-25 14:18:41.000000000) ---
Patch Set 8: Code-Review+1

--- Message (Patrick Farrell, 2023-10-20 00:26:56.000000000) ---
Uploaded patch set 9: Patch Set 8 was rebased.

--- Message (wc-checkpatch, 2023-10-20 00:35:22.000000000) ---
Patch Set 9:

(2 comments)

2 style warning(s).
For more details please see http://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (jenkins, 2023-10-20 02:50:19.000000000) ---
Patch Set 9: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/99567/ : SUCCESS

--- Message (Patrick Farrell, 2023-11-27 15:51:16.000000000) ---
Patch Set 9:

BUILD

--- Message (jenkins, 2023-11-27 16:35:49.000000000) ---
Patch Set 9:

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/100520/ : SUCCESS

--- Message (Patrick Farrell, 2024-01-19 18:14:01.000000000) ---
Patch Set 10: Patch Set 9 was rebased

--- Message (wc-checkpatch, 2024-01-19 18:19:44.000000000) ---
Patch Set 10:

(2 comments)

2 style warning(s).
For more details please see http://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (jenkins, 2024-01-19 19:53:52.000000000) ---
Patch Set 10: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/101502/ : SUCCESS

--- Message (wc-checkpatch, 2024-02-23 08:39:26.000000000) ---
Patch Set 10: Code-Review-1

This change cannot be cherry-picked to master.
Please rebase the change locally and upload the rebased commit for review.

--- Message (Patrick Farrell, 2024-02-27 20:09:18.000000000) ---
Uploaded patch set 11.

--- Message (wc-checkpatch, 2024-02-27 20:10:35.000000000) ---
Patch Set 11:

(2 comments)

2 style warning(s).
For more details please see http://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (jenkins, 2024-02-28 00:14:08.000000000) ---
Patch Set 11: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/102570/ : SUCCESS

--- Message (Sebastien Buisson, 2024-03-04 08:03:02.000000000) ---
Patch Set 11: Code-Review+1

--- Message (Patrick Farrell, 2024-10-28 04:12:18.000000000) ---
Uploaded patch set 12.

--- Message (wc-checkpatch, 2024-10-28 04:13:17.000000000) ---
Patch Set 12:

(2 comments)

2 style warning(s).
For more details please see https://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (Andreas Dilger, 2024-10-28 05:39:23.000000000) ---
Patch Set 12: Code-Review+1

--- Message (jenkins, 2024-10-28 06:53:16.000000000) ---
Patch Set 12: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/108569/ : SUCCESS

--- Message (Patrick Farrell, 2024-11-03 23:07:05.000000000) ---
Uploaded patch set 13: Patch Set 12 was rebased.

--- Message (wc-checkpatch, 2024-11-03 23:20:58.000000000) ---
Patch Set 13:

(2 comments)

2 style warning(s).
For more details please see https://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (jenkins, 2024-11-03 23:56:41.000000000) ---
Patch Set 13: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/108742/ : SUCCESS

--- Message (Sebastien Buisson, 2024-11-05 15:16:24.000000000) ---
Patch Set 13: Code-Review+1

--- Message (Shaun Tancheff, 2024-11-13 03:51:18.000000000) ---
Patch Set 13:

(1 comment)

--- Message (Patrick Farrell, 2024-11-13 16:09:20.000000000) ---
Patch Set 13:

(1 comment)

--- Message (Andreas Dilger, 2024-11-14 06:42:10.000000000) ---
Patch Set 13:

(1 comment)

--- Message (Patrick Farrell, 2025-04-28 16:19:13.000000000) ---
Uploaded patch set 14.

--- Message (wc-checkpatch, 2025-04-28 16:24:58.000000000) ---
Patch Set 14:

(2 comments)

2 style warning(s).
For more details please see https://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (jenkins, 2025-04-28 17:21:49.000000000) ---
Patch Set 14: Verified-1

Build Failed 

https://build.whamcloud.com/job/lustre-reviews/112889/ : FAILURE

--- Message (Patrick Farrell, 2025-05-01 01:37:53.000000000) ---
Uploaded patch set 15: Patch Set 14 was rebased.

--- Message (wc-checkpatch, 2025-05-01 01:43:09.000000000) ---
Patch Set 15:

(2 comments)

2 style warning(s).
For more details please see https://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (jenkins, 2025-05-01 01:51:22.000000000) ---
Patch Set 15: Verified-1

Build Failed 

https://build.whamcloud.com/job/lustre-reviews/112965/ : FAILURE

--- Message (Patrick Farrell, 2025-11-09 22:52:18.000000000) ---
Uploaded patch set 16.

Outdated Votes:
* Verified-1 (copy condition: "changekind:NO_CHANGE OR changekind:NO_CODE_CHANGE")

--- Message (wc-checkpatch, 2025-11-09 23:06:42.000000000) ---
Patch Set 16:

(2 comments)

2 style warning(s).
For more details please see https://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (Misc Code Checks Robot (Gatekeeper helper), 2025-11-09 23:10:06.000000000) ---
Patch Set 16:

Code-wise looks good to me, -2 warnings less than parent.

--- Message (Patrick Farrell, 2025-11-16 21:50:00.000000000) ---
Patch Set 17: Patch Set 16 was rebased

--- Message (jenkins, 2025-11-16 21:56:57.000000000) ---
Patch Set 17: Verified-1

Build Failed 

https://build.whamcloud.com/job/lustre-reviews/118650/ : FAILURE

--- Message (wc-checkpatch, 2025-11-16 22:03:20.000000000) ---
Patch Set 17:

(2 comments)

2 style warning(s).
For more details please see https://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (Patrick Farrell, 2025-11-16 22:03:57.000000000) ---
Uploaded patch set 18: Commit message was updated.

Copied Votes:
* Verified-1 (copy condition: "changekind:NO_CHANGE OR **changekind:NO_CODE_CHANGE**")

--- Message (Misc Code Checks Robot (Gatekeeper helper), 2025-11-16 22:08:02.000000000) ---
Patch Set 17:

Code-wise looks good to me, -2 warnings less than parent.

--- Message (wc-checkpatch, 2025-11-16 22:21:04.000000000) ---
Patch Set 18:

(2 comments)

2 style warning(s).
For more details please see https://wiki.lustre.org/Lustre_Coding_Style_Guidelines

--- Message (Misc Code Checks Robot (Gatekeeper helper), 2025-11-16 22:38:39.000000000) ---
Patch Set 18:

Code-wise looks good to me, -2 warnings less than parent.

--- Message (jenkins, 2025-11-16 23:37:50.000000000) ---
Patch Set 18: Verified+1

Build Successful 

https://build.whamcloud.com/job/lustre-reviews/118661/ : SUCCESS
