<!-- 
RSS generated by JIRA (9.4.29#940029-sha1:4daa0635650e368c1b281e719d2298e7d3994659) at Wed Mar 04 19:28:39 UTC 2026

It is possible to restrict the fields that are returned in this document by specifying the 'field' parameter in your request.
For example, to request only the issue key and summary append 'field=key&field=summary' to the URL of your request.
-->
<rss version="0.92" >
<channel>
    <title>Whamcloud Community JIRA</title>
    <link>https://jira.whamcloud.com</link>
    <description>This file is an XML representation of an issue</description>
    <language>en-us</language>    <build-info>
        <version>9.4.29</version>
        <build-number>940029</build-number>
        <build-date>03-12-2024</build-date>
    </build-info>


<item>
            <title>[LU-3059] shrink lod_object to 128 bytes</title>
                <link>https://jira.whamcloud.com/browse/LU-3059</link>
                <project id="10000" key="LU">Lustre</project>
                    <description>&lt;p&gt;Before:&lt;/p&gt;
&lt;div class=&quot;preformatted panel&quot; style=&quot;border-width: 1px;&quot;&gt;&lt;div class=&quot;preformattedContent panelContent&quot;&gt;
&lt;pre&gt;struct lod_object {
        struct dt_object           ldo_obj;              /*     0    88 */
        /* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */
        __u16                      ldo_stripenr;         /*    88     2 */
        __u16                      ldo_layout_gen;       /*    90     2 */
        __u32                      ldo_stripe_size;      /*    92     4 */
        char *                     ldo_pool;             /*    96     8 */
        struct dt_object * *       ldo_stripe;           /*   104     8 */
        int                        ldo_stripes_allocated; /*   112     4 */
        unsigned int               ldo_striping_cached:1; /*   116:31  4 */
        unsigned int               ldo_def_striping_set:1; /*   116:30  4 */

        /* XXX 30 bits hole, try to pack */

        __u32                      ldo_def_stripe_size;  /*   120     4 */
        __u16                      ldo_def_stripenr;     /*   124     2 */
        __u16                      ldo_def_stripe_offset; /*   126     2 */
        /* --- cacheline 2 boundary (128 bytes) --- */
        mdsno_t                    ldo_mds_num;          /*   128     4 */

        /* size: 136, cachelines: 3, members: 13 */
        /* bit holes: 1, sum bit holes: 30 bits */
        /* padding: 4 */
        /* last cacheline: 8 bytes */
};
&lt;/pre&gt;
&lt;/div&gt;&lt;/div&gt;

&lt;p&gt;After:&lt;/p&gt;
&lt;div class=&quot;preformatted panel&quot; style=&quot;border-width: 1px;&quot;&gt;&lt;div class=&quot;preformattedContent panelContent&quot;&gt;
&lt;pre&gt;struct lod_object {
        struct dt_object           ldo_obj;              /*     0    88 */
        /* --- cacheline 1 boundary (64 bytes) was 24 bytes ago --- */
        __u16                      ldo_stripenr;         /*    88     2 */
        __u16                      ldo_layout_gen;       /*    90     2 */
        __u32                      ldo_stripe_size;      /*    92     4 */
        char *                     ldo_pool;             /*    96     8 */
        struct dt_object * *       ldo_stripe;           /*   104     8 */
        unsigned int               ldo_stripes_allocated:16; /*   112:16  4 */
        unsigned int               ldo_striping_cached:1; /*   112:15  4 */
        unsigned int               ldo_def_striping_set:1; /*   112:14  4 */

        /* XXX 14 bits hole, try to pack */

        __u32                      ldo_def_stripe_size;  /*   116     4 */
        __u16                      ldo_def_stripenr;     /*   120     2 */
        __u16                      ldo_def_stripe_offset; /*   122     2 */
        mdsno_t                    ldo_mds_num;          /*   124     4 */
        /* --- cacheline 2 boundary (128 bytes) --- */

        /* size: 128, cachelines: 2, members: 13 */
        /* bit holes: 1, sum bit holes: 14 bits */
};
&lt;/pre&gt;
&lt;/div&gt;&lt;/div&gt;</description>
                <environment></environment>
        <key id="18152">LU-3059</key>
            <summary>shrink lod_object to 128 bytes</summary>
                <type id="1" iconUrl="https://jira.whamcloud.com/secure/viewavatar?size=xsmall&amp;avatarId=11303&amp;avatarType=issuetype">Bug</type>
                                            <priority id="4" iconUrl="https://jira.whamcloud.com/images/icons/priorities/minor.svg">Minor</priority>
                        <status id="5" iconUrl="https://jira.whamcloud.com/images/icons/statuses/resolved.png" description="A resolution has been taken, and it is awaiting verification by reporter. From here issues are either reopened, or are closed.">Resolved</status>
                    <statusCategory id="3" key="done" colorName="success"/>
                                    <resolution id="1">Fixed</resolution>
                                        <assignee username="jhammond">John Hammond</assignee>
                                    <reporter username="jhammond">John Hammond</reporter>
                        <labels>
                            <label>lod</label>
                    </labels>
                <created>Thu, 28 Mar 2013 18:34:01 +0000</created>
                <updated>Mon, 2 Jun 2014 15:54:25 +0000</updated>
                            <resolved>Tue, 23 Jul 2013 14:30:11 +0000</resolved>
                                    <version>Lustre 2.4.0</version>
                                    <fixVersion>Lustre 2.4.0</fixVersion>
                    <fixVersion>Lustre 2.5.0</fixVersion>
                    <fixVersion>Lustre 2.6.0</fixVersion>
                                        <due></due>
                            <votes>0</votes>
                                    <watches>2</watches>
                                                                            <comments>
                            <comment id="62812" author="jhammond" created="Tue, 23 Jul 2013 14:30:11 +0000"  >&lt;p&gt;All four patches landed to master. On 2.4.52-37-g6350af1 compiled for x86_64 we have the following object sizes:&lt;/p&gt;
&lt;div class=&quot;preformatted panel&quot; style=&quot;border-width: 1px;&quot;&gt;&lt;div class=&quot;preformattedContent panelContent&quot;&gt;
&lt;pre&gt;lu_object_header  88
cl_object_header 152

lu                40
cl                56
md                56
dt                64
mdd               80
lod              112
osd_ldiskfs      176 
osp              200
lov              224
ccc              248
mdt              256
osc              272
&lt;/pre&gt;
&lt;/div&gt;&lt;/div&gt;</comment>
                            <comment id="55331" author="jhammond" created="Tue, 2 Apr 2013 20:17:36 +0000"  >&lt;p&gt;&lt;a href=&quot;http://review.whamcloud.com/#change,5920&quot; class=&quot;external-link&quot; target=&quot;_blank&quot; rel=&quot;nofollow noopener&quot;&gt;http://review.whamcloud.com/#change,5920&lt;/a&gt; obdclass: use a dummy structure for lu_ref_link&lt;/p&gt;</comment>
                            <comment id="55100" author="jhammond" created="Fri, 29 Mar 2013 16:34:57 +0000"  >&lt;p&gt;&lt;a href=&quot;http://review.whamcloud.com/5892&quot; class=&quot;external-link&quot; target=&quot;_blank&quot; rel=&quot;nofollow noopener&quot;&gt;http://review.whamcloud.com/5892&lt;/a&gt; shrink dt_object by 8 bytes on x86_64&lt;/p&gt;</comment>
                            <comment id="55096" author="jhammond" created="Fri, 29 Mar 2013 16:16:27 +0000"  >&lt;p&gt;&lt;a href=&quot;http://review.whamcloud.com/5890&quot; class=&quot;external-link&quot; target=&quot;_blank&quot; rel=&quot;nofollow noopener&quot;&gt;http://review.whamcloud.com/5890&lt;/a&gt; shrink lu_object by 16 bytes on x86_64&lt;/p&gt;</comment>
                            <comment id="55060" author="jhammond" created="Thu, 28 Mar 2013 22:25:40 +0000"  >&lt;p&gt;Please see &lt;a href=&quot;http://review.whamcloud.com/5878&quot; class=&quot;external-link&quot; target=&quot;_blank&quot; rel=&quot;nofollow noopener&quot;&gt;http://review.whamcloud.com/5878&lt;/a&gt;.&lt;/p&gt;

&lt;p&gt;But then there definitely needs to be a lock in lod_object.&lt;/p&gt;</comment>
                            <comment id="55044" author="bzzz" created="Thu, 28 Mar 2013 18:46:48 +0000"  >&lt;p&gt;we could &lt;b&gt;also&lt;/b&gt; turn ldo_stripe + ldo_stripes_allocated + ldo_striping_cached + ldo_def_striping_set (probably more?) a separately allocated structure.&lt;br/&gt;
because most of time we don&apos;t use those fields at all.&lt;/p&gt;

&lt;p&gt;then use SLAB to pack ldo_object structures better in a page.&lt;/p&gt;</comment>
                    </comments>
                <issuelinks>
                            <issuelinktype id="10011">
                    <name>Related</name>
                                            <outwardlinks description="is related to ">
                                        <issuelink>
            <issuekey id="17520">LU-2789</issuekey>
        </issuelink>
                            </outwardlinks>
                                                        </issuelinktype>
                    </issuelinks>
                <attachments>
                    </attachments>
                <subtasks>
                    </subtasks>
                <customfields>
                                                                                                                                                                <customfield id="customfield_10003" key="com.atlassian.jira.plugin.system.customfieldtypes:float">
                        <customfieldname>Business Value</customfieldname>
                        <customfieldvalues>
                            <customfieldvalue>-7.0</customfieldvalue>
                        </customfieldvalues>
                    </customfield>
                                                                <customfield id="customfield_10890" key="com.atlassian.jira.plugins.jira-development-integration-plugin:devsummary">
                        <customfieldname>Development</customfieldname>
                        <customfieldvalues>
                            
                        </customfieldvalues>
                    </customfield>
                                                                                                                                                                                                                                                                                                                                                        <customfield id="customfield_10390" key="com.pyxis.greenhopper.jira:gh-lexo-rank">
                        <customfieldname>Rank</customfieldname>
                        <customfieldvalues>
                            <customfieldvalue>1|hzvmlr:</customfieldvalue>

                        </customfieldvalues>
                    </customfield>
                                                                <customfield id="customfield_10090" key="com.pyxis.greenhopper.jira:gh-global-rank">
                        <customfieldname>Rank (Obsolete)</customfieldname>
                        <customfieldvalues>
                            <customfieldvalue>7456</customfieldvalue>
                        </customfieldvalues>
                    </customfield>
                                                                                            <customfield id="customfield_10060" key="com.atlassian.jira.plugin.system.customfieldtypes:select">
                        <customfieldname>Severity</customfieldname>
                        <customfieldvalues>
                                <customfieldvalue key="10022"><![CDATA[3]]></customfieldvalue>

                        </customfieldvalues>
                    </customfield>
                                                                                                                                                                                                                                                                                                                                                        </customfields>
    </item>
</channel>
</rss>