<!-- 
RSS generated by JIRA (9.4.29#940029-sha1:4daa0635650e368c1b281e719d2298e7d3994659) at Wed Mar 04 20:00:12 UTC 2026

It is possible to restrict the fields that are returned in this document by specifying the 'field' parameter in your request.
For example, to request only the issue key and summary append 'field=key&field=summary' to the URL of your request.
-->
<rss version="0.92" >
<channel>
    <title>Whamcloud Community JIRA</title>
    <link>https://jira.whamcloud.com</link>
    <description>This file is an XML representation of an issue</description>
    <language>en-us</language>    <build-info>
        <version>9.4.29</version>
        <build-number>940029</build-number>
        <build-date>03-12-2024</build-date>
    </build-info>


<item>
            <title>[LU-6324] CLASSERT(sizeof(struct osd_thread_info) &lt;= PAGE_SIZE) fails for some configs</title>
                <link>https://jira.whamcloud.com/browse/LU-6324</link>
                <project id="10000" key="LU">Lustre</project>
                    <description>&lt;p&gt;I am unable to build v2_7_50_0-10-g56875fd (&lt;a href=&quot;https://jira.whamcloud.com/browse/LU-3680&quot; title=&quot;OOM crash: null_alloc_rs()) ASSERTION( rs-&amp;gt;rs_size &amp;gt;= rs_size ) failed&quot; class=&quot;issue-link&quot; data-issue-key=&quot;LU-3680&quot;&gt;&lt;del&gt;LU-3680&lt;/del&gt;&lt;/a&gt; osd: reduce osd_thread_info in ldiskfs osd,  &lt;a href=&quot;http://review.whamcloud.com/9726&quot; class=&quot;external-link&quot; target=&quot;_blank&quot; rel=&quot;nofollow noopener&quot;&gt;http://review.whamcloud.com/9726&lt;/a&gt;) due to the added CLASSERT() in osd_mod_init() and the that fact that I enable several CONFIG_DEBUG_*.&lt;/p&gt;
&lt;div class=&quot;preformatted panel&quot; style=&quot;border-width: 1px;&quot;&gt;&lt;div class=&quot;preformattedContent panelContent&quot;&gt;
&lt;pre&gt;struct osd_thread_info {
        const struct lu_env  *     oti_env;              /*     0     8 */
        struct dentry              oti_obj_dentry;       /*     8   256 */
        /* --- cacheline 4 boundary (256 bytes) was 8 bytes ago --- */
        struct dentry              oti_child_dentry;     /*   264   256 */
        /* --- cacheline 8 boundary (512 bytes) was 8 bytes ago --- */
        struct dentry              oti_it_dentry;        /*   520   256 */
        /* --- cacheline 12 boundary (768 bytes) was 8 bytes ago --- */
        union {
                struct file        oti_file;             /*         304 */
                struct kstatfs     oti_ksfs;             /*         120 */
        };                                               /*   776   304 */
        /* --- cacheline 16 boundary (1024 bytes) was 56 bytes ago --- */
        struct htree_lock *        oti_hlock;            /*  1080     8 */
        /* --- cacheline 17 boundary (1088 bytes) --- */
        struct lu_fid              oti_fid;              /*  1088    16 */
        struct lu_fid              oti_fid2;             /*  1104    16 */
        struct lu_fid              oti_fid3;             /*  1120    16 */
        struct osd_inode_id        oti_id;               /*  1136     8 */
        struct osd_inode_id        oti_id2;              /*  1144     8 */
        /* --- cacheline 18 boundary (1152 bytes) --- */
        struct osd_inode_id        oti_id3;              /*  1152     8 */
        struct ost_id              oti_ostid;            /*  1160    16 */
        struct timespec            oti_time;             /*  1176    16 */
        struct lustre_capa_key     oti_capa_key;         /*  1192    72 */
        /* --- cacheline 19 boundary (1216 bytes) was 48 bytes ago --- */
        struct lustre_capa         oti_capa;             /*  1264   120 */
        /* --- cacheline 21 boundary (1344 bytes) was 40 bytes ago --- */
        struct osd_device *        oti_dev;              /*  1384     8 */
        void *                     oti_it_ea_buf;        /*  1392     8 */
        unsigned int               oti_it_ea_buf_used:1; /*  1400:31  4 */

        /* XXX 31 bits hole, try to pack */
        /* XXX 4 bytes hole, try to pack */

        /* --- cacheline 22 boundary (1408 bytes) --- */
        struct iam_iterator        oti_idx_it;           /*  1408   312 */
        /* --- cacheline 26 boundary (1664 bytes) was 56 bytes ago --- */
        union {
                char               oti_name[48];         /*          48 */
                char               oti_it_ipd[816];      /*         816 */
                long long int      oti_alignment_lieutenant; /*           8 */
        };                                               /*  1720   816 */
        /* --- cacheline 39 boundary (2496 bytes) was 40 bytes ago --- */
        union {
                char               oti_idx_ipd[816];     /*         816 */
                long long int      oti_alignment_lieutenant_colonel; /*           8 */
        };                                               /*  2536   816 */
        /* --- cacheline 52 boundary (3328 bytes) was 24 bytes ago --- */
        struct osd_idmap_cache     oti_cache;            /*  3352    32 */
        int                        oti_r_locks;          /*  3384     4 */
        int                        oti_w_locks;          /*  3388     4 */
        /* --- cacheline 53 boundary (3392 bytes) --- */
        int                        oti_txns;             /*  3392     4 */

        /* XXX 4 bytes hole, try to pack */

        struct lu_buf              oti_buf;              /*  3400    16 */
        struct lu_buf              oti_big_buf;          /*  3416    16 */
        union {
                struct lustre_mdt_attrs oti_mdt_attrs;   /*          24 */
                char               oti_mdt_attrs_old[64]; /*          64 */
                struct filter_fid_old oti_ff;            /*          32 */
                struct filter_fid  oti_ff_new;           /*          16 */
        };                                               /*  3432    64 */
        /* --- cacheline 54 boundary (3456 bytes) was 40 bytes ago --- */
        struct osd_iobuf           oti_iobuf;            /*  3496   184 */

        /* XXX last struct has 4 bytes of padding */

        /* --- cacheline 57 boundary (3648 bytes) was 32 bytes ago --- */
        struct inode *             oti_inode;            /*  3680     8 */
        char                       oti_ldp[32];          /*  3688    32 */
        /* --- cacheline 58 boundary (3712 bytes) was 8 bytes ago --- */
        char                       oti_ldp2[32];         /*  3720    32 */
        union {
                struct if_dqblk    oti_dqblk;            /*          72 */
                struct if_dqinfo   oti_dqinfo;           /*          24 */
        };                                               /*  3752    72 */
        /* --- cacheline 59 boundary (3776 bytes) was 48 bytes ago --- */
        struct lquota_id_info      oti_qi;               /*  3824    48 */

        /* XXX last struct has 7 bytes of padding */

        /* --- cacheline 60 boundary (3840 bytes) was 32 bytes ago --- */
        struct lquota_trans        oti_quota_trans;      /*  3872   200 */
        /* --- cacheline 63 boundary (4032 bytes) was 40 bytes ago --- */
        union lquota_rec           oti_quota_rec;        /*  4072    32 */
        /* --- cacheline 64 boundary (4096 bytes) was 8 bytes ago --- */
        __u64                      oti_quota_id;         /*  4104     8 */
        struct lu_seq_range        oti_seq_range;        /*  4112    24 */
        short unsigned int         oti_declare_ops[11];  /*  4136    22 */
        short unsigned int         oti_declare_ops_rb[11]; /*  4158    22 */
        /* --- cacheline 65 boundary (4160 bytes) was 20 bytes ago --- */
        short unsigned int         oti_declare_ops_cred[11]; /*  4180    22 */
        bool                       oti_rollback;         /*  4202     1 */

        /* size: 4208, cachelines: 66, members: 43 */
        /* sum members: 4195, holes: 2, sum holes: 8 */
        /* bit holes: 1, sum bit holes: 31 bits */
        /* padding: 5 */
        /* paddings: 2, sum paddings: 11 */
        /* last cacheline: 48 bytes */
};
&lt;/pre&gt;
&lt;/div&gt;&lt;/div&gt;

&lt;p&gt;My config is attached.&lt;/p&gt;</description>
                <environment></environment>
        <key id="28931">LU-6324</key>
            <summary>CLASSERT(sizeof(struct osd_thread_info) &lt;= PAGE_SIZE) fails for some configs</summary>
                <type id="1" iconUrl="https://jira.whamcloud.com/secure/viewavatar?size=xsmall&amp;avatarId=11303&amp;avatarType=issuetype">Bug</type>
                                            <priority id="3" iconUrl="https://jira.whamcloud.com/images/icons/priorities/major.svg">Major</priority>
                        <status id="5" iconUrl="https://jira.whamcloud.com/images/icons/statuses/resolved.png" description="A resolution has been taken, and it is awaiting verification by reporter. From here issues are either reopened, or are closed.">Resolved</status>
                    <statusCategory id="3" key="done" colorName="success"/>
                                    <resolution id="1">Fixed</resolution>
                                        <assignee username="bzzz">Alex Zhuravlev</assignee>
                                    <reporter username="jhammond">John Hammond</reporter>
                        <labels>
                    </labels>
                <created>Tue, 3 Mar 2015 13:57:43 +0000</created>
                <updated>Tue, 7 Jul 2015 14:05:35 +0000</updated>
                            <resolved>Tue, 7 Jul 2015 14:05:35 +0000</resolved>
                                    <version>Lustre 2.8.0</version>
                                    <fixVersion>Lustre 2.8.0</fixVersion>
                                        <due></due>
                            <votes>0</votes>
                                    <watches>6</watches>
                                                                            <comments>
                            <comment id="109514" author="gerrit" created="Wed, 11 Mar 2015 23:41:07 +0000"  >&lt;p&gt;Oleg Drokin (oleg.drokin@intel.com) merged in patch &lt;a href=&quot;http://review.whamcloud.com/13955/&quot; class=&quot;external-link&quot; target=&quot;_blank&quot; rel=&quot;nofollow noopener&quot;&gt;http://review.whamcloud.com/13955/&lt;/a&gt;&lt;br/&gt;
Subject: &lt;a href=&quot;https://jira.whamcloud.com/browse/LU-6324&quot; title=&quot;CLASSERT(sizeof(struct osd_thread_info) &amp;lt;= PAGE_SIZE) fails for some configs&quot; class=&quot;issue-link&quot; data-issue-key=&quot;LU-6324&quot;&gt;&lt;del&gt;LU-6324&lt;/del&gt;&lt;/a&gt; osd: allow larger osd_thread_info for debug&lt;br/&gt;
Project: fs/lustre-release&lt;br/&gt;
Branch: master&lt;br/&gt;
Current Patch Set: &lt;br/&gt;
Commit: c65d83dd93fc61c44a1f0503e196a123d57dfb88&lt;/p&gt;</comment>
                            <comment id="108786" author="jhammond" created="Wed, 4 Mar 2015 19:54:40 +0000"  >&lt;p&gt;Oleg, can you post the output of &apos;pahole lustre/osd-ldiskfs/osd_handler.o&apos;?&lt;/p&gt;</comment>
                            <comment id="108651" author="green" created="Tue, 3 Mar 2015 21:13:44 +0000"  >&lt;p&gt;that&apos;s because you happen to have those two set too.&lt;/p&gt;

&lt;p&gt;I guess they are a good proxy for &quot;debug enabled kernel&quot; in the end but it might be interesting to see what is the real reason.&lt;/p&gt;

&lt;p&gt;here&apos;s a relevant diff between my (orig) and your configs:&lt;/p&gt;
&lt;div class=&quot;preformatted panel&quot; style=&quot;border-width: 1px;&quot;&gt;&lt;div class=&quot;preformattedContent panelContent&quot;&gt;
&lt;pre&gt; #
 # Kernel hacking
@@ -4111,7 +4227,7 @@
 # CONFIG_UNUSED_SYMBOLS is not set
 CONFIG_DEBUG_FS=y
 CONFIG_HEADERS_CHECK=y
-# CONFIG_DEBUG_SECTION_MISMATCH is not set
+CONFIG_DEBUG_SECTION_MISMATCH=y
 CONFIG_DEBUG_KERNEL=y
 CONFIG_DEBUG_SHIRQ=y
 CONFIG_DETECT_SOFTLOCKUP=y
@@ -4119,8 +4235,8 @@
 CONFIG_HARDLOCKUP_DETECTOR=y
 CONFIG_BOOTPARAM_HARDLOCKUP_ENABLED=y
 CONFIG_BOOTPARAM_HARDLOCKUP_ENABLED_VALUE=1
-# CONFIG_BOOTPARAM_HARDLOCKUP_PANIC is not set
-CONFIG_BOOTPARAM_HARDLOCKUP_PANIC_VALUE=0
+CONFIG_BOOTPARAM_HARDLOCKUP_PANIC=y
+CONFIG_BOOTPARAM_HARDLOCKUP_PANIC_VALUE=1
 # CONFIG_BOOTPARAM_SOFTLOCKUP_PANIC is not set
 CONFIG_BOOTPARAM_SOFTLOCKUP_PANIC_VALUE=0
 CONFIG_DETECT_HUNG_TASK=y
@@ -4132,33 +4248,39 @@
 CONFIG_TIMER_STATS=y
 CONFIG_DEBUG_OBJECTS=y
 # CONFIG_DEBUG_OBJECTS_SELFTEST is not set
-CONFIG_DEBUG_OBJECTS_FREE=y
+# CONFIG_DEBUG_OBJECTS_FREE is not set
 # CONFIG_DEBUG_OBJECTS_TIMERS is not set
 CONFIG_DEBUG_OBJECTS_ENABLE_DEFAULT=1
 CONFIG_DEBUG_SLAB=y
 # CONFIG_DEBUG_SLAB_LEAK is not set
-# CONFIG_DEBUG_KMEMLEAK is not set
-# CONFIG_DEBUG_RT_MUTEXES is not set
+CONFIG_DEBUG_KMEMLEAK=y
+CONFIG_DEBUG_KMEMLEAK_EARLY_LOG_SIZE=400
+# CONFIG_DEBUG_KMEMLEAK_TEST is not set
+# CONFIG_DEBUG_KMEMLEAK_DEFAULT_OFF is not set
+CONFIG_DEBUG_RT_MUTEXES=y
+CONFIG_DEBUG_PI_LIST=y
 # CONFIG_RT_MUTEX_TESTER is not set
 CONFIG_DEBUG_SPINLOCK=y
 CONFIG_DEBUG_MUTEXES=y
-# CONFIG_DEBUG_WW_MUTEX_SLOWPATH is not set
-# CONFIG_DEBUG_LOCK_ALLOC is not set
-# CONFIG_PROVE_LOCKING is not set
-# CONFIG_LOCK_STAT is not set
+CONFIG_DEBUG_LOCK_ALLOC=y
+CONFIG_PROVE_LOCKING=y
+CONFIG_LOCKDEP=y
+CONFIG_LOCK_STAT=y
+# CONFIG_DEBUG_LOCKDEP is not set
+CONFIG_TRACE_IRQFLAGS=y
 CONFIG_DEBUG_SPINLOCK_SLEEP=y
 # CONFIG_DEBUG_LOCKING_API_SELFTESTS is not set
 CONFIG_STACKTRACE=y
 # CONFIG_DEBUG_KOBJECT is not set
 CONFIG_DEBUG_BUGVERBOSE=y
 CONFIG_DEBUG_INFO=y
-# CONFIG_DEBUG_VM is not set
-# CONFIG_DEBUG_VIRTUAL is not set
-CONFIG_DEBUG_WRITECOUNT=y
+CONFIG_DEBUG_VM=y
+CONFIG_DEBUG_VIRTUAL=y
+# CONFIG_DEBUG_WRITECOUNT is not set
 CONFIG_DEBUG_MEMORY_INIT=y
 CONFIG_DEBUG_LIST=y
 # CONFIG_DEBUG_SG is not set
-CONFIG_DEBUG_NOTIFIERS=y
+# CONFIG_DEBUG_NOTIFIERS is not set
 # CONFIG_DEBUG_CREDENTIALS is not set
 CONFIG_ARCH_WANT_FRAME_POINTERS=y
 CONFIG_FRAME_POINTER=y
@@ -4170,15 +4292,10 @@
 # CONFIG_DEBUG_BLOCK_EXT_DEVT is not set
 # CONFIG_DEBUG_FORCE_WEAK_PER_CPU is not set
 # CONFIG_LKDTM is not set
-CONFIG_FAULT_INJECTION=y
-CONFIG_FAILSLAB=y
-CONFIG_FAIL_PAGE_ALLOC=y
-CONFIG_FAIL_MAKE_REQUEST=y
-# CONFIG_FAIL_IO_TIMEOUT is not set
-# CONFIG_FAULT_INJECTION_DEBUG_FS is not set
-CONFIG_LATENCYTOP=y
-CONFIG_SYSCTL_SYSCALL_CHECK=y
-CONFIG_DEBUG_PAGEALLOC=y
+# CONFIG_FAULT_INJECTION is not set
+# CONFIG_LATENCYTOP is not set
+# CONFIG_SYSCTL_SYSCALL_CHECK is not set
+# CONFIG_DEBUG_PAGEALLOC is not set
 CONFIG_USER_STACKTRACE_SUPPORT=y
 CONFIG_NOP_TRACER=y
 CONFIG_HAVE_FTRACE_NMI_ENTER=y
@@ -4221,12 +4338,12 @@
 # CONFIG_FTRACE_STARTUP_TEST is not set
 # CONFIG_MMIOTRACE is not set
 CONFIG_RING_BUFFER_BENCHMARK=m
-# CONFIG_PROVIDE_OHCI1394_DMA_INIT is not set
+CONFIG_PROVIDE_OHCI1394_DMA_INIT=y
 # CONFIG_FIREWIRE_OHCI_REMOTE_DMA is not set
-# CONFIG_BUILD_DOCSRC is not set
+CONFIG_BUILD_DOCSRC=y
 CONFIG_DYNAMIC_DEBUG=y
 # CONFIG_DMA_API_DEBUG is not set
-# CONFIG_ASYNC_RAID6_TEST is not set
+CONFIG_ASYNC_RAID6_TEST=m
 # CONFIG_SAMPLES is not set
 CONFIG_HAVE_ARCH_KGDB=y
 CONFIG_KGDB=y
@@ -4235,18 +4352,17 @@
 # CONFIG_KGDB_TESTS_ON_BOOT is not set
 CONFIG_HAVE_ARCH_KMEMCHECK=y
 # CONFIG_TEST_KSTRTOX is not set
-# CONFIG_STRICT_DEVMEM is not set
+CONFIG_STRICT_DEVMEM=y
 # CONFIG_X86_VERBOSE_BOOTUP is not set
 CONFIG_EARLY_PRINTK=y
-# CONFIG_EARLY_PRINTK_DBGP is not set
-# CONFIG_EARLY_PRINTK_EFI is not set
+CONFIG_EARLY_PRINTK_DBGP=y
 CONFIG_DEBUG_STACKOVERFLOW=y
-CONFIG_DEBUG_STACK_USAGE=y
+# CONFIG_DEBUG_STACK_USAGE is not set
 # CONFIG_DEBUG_PER_CPU_MAPS is not set
 # CONFIG_X86_PTDUMP is not set
 CONFIG_DEBUG_RODATA=y
-# CONFIG_DEBUG_RODATA_TEST is not set
-# CONFIG_DEBUG_NX_TEST is not set
+CONFIG_DEBUG_RODATA_TEST=y
+CONFIG_DEBUG_NX_TEST=m
 # CONFIG_IOMMU_DEBUG is not set
 # CONFIG_IOMMU_STRESS is not set
 CONFIG_HAVE_MMIOTRACE_SUPPORT=y
&lt;/pre&gt;
&lt;/div&gt;&lt;/div&gt;</comment>
                            <comment id="108648" author="jhammond" created="Tue, 3 Mar 2015 21:05:49 +0000"  >&lt;p&gt;It works for me. &lt;img class=&quot;emoticon&quot; src=&quot;https://jira.whamcloud.com/images/icons/emoticons/wink.png&quot; height=&quot;16&quot; width=&quot;16&quot; align=&quot;absmiddle&quot; alt=&quot;&quot; border=&quot;0&quot;/&gt;&lt;/p&gt;</comment>
                            <comment id="108647" author="green" created="Tue, 3 Mar 2015 20:57:47 +0000"  >&lt;p&gt;This is not the real reason for blown up structure sizes.&lt;/p&gt;

&lt;p&gt;I have all of those set and my struct size is still about 3500&lt;/p&gt;
&lt;div class=&quot;preformatted panel&quot; style=&quot;border-width: 1px;&quot;&gt;&lt;div class=&quot;preformattedContent panelContent&quot;&gt;
&lt;pre&gt;[green@intelbox lustre-release]$ grep CONFIG_DEBUG_MUTEXES ~/bk/linux-2.6.32-504.3.3.el6-debug/.config
CONFIG_DEBUG_MUTEXES=y
[green@intelbox lustre-release]$ grep CONFIG_DEBUG_SPINLOCK ~/bk/linux-2.6.32-504.3.3.el6-debug/.config
CONFIG_DEBUG_SPINLOCK=y
CONFIG_DEBUG_SPINLOCK_SLEEP=y
Reading symbols from /home/green/git/lustre-release/lustre/osd-ldiskfs/osd_ldiskfs.ko...done.
(gdb) p sizeof(struct osd_thread_info)
$1 = 3576
&lt;/pre&gt;
&lt;/div&gt;&lt;/div&gt;

&lt;p&gt;The culprit must be something else&lt;/p&gt;</comment>
                            <comment id="108639" author="gerrit" created="Tue, 3 Mar 2015 20:23:44 +0000"  >&lt;p&gt;John L. Hammond (john.hammond@intel.com) uploaded a new patch: &lt;a href=&quot;http://review.whamcloud.com/13955&quot; class=&quot;external-link&quot; target=&quot;_blank&quot; rel=&quot;nofollow noopener&quot;&gt;http://review.whamcloud.com/13955&lt;/a&gt;&lt;br/&gt;
Subject: &lt;a href=&quot;https://jira.whamcloud.com/browse/LU-6324&quot; title=&quot;CLASSERT(sizeof(struct osd_thread_info) &amp;lt;= PAGE_SIZE) fails for some configs&quot; class=&quot;issue-link&quot; data-issue-key=&quot;LU-6324&quot;&gt;&lt;del&gt;LU-6324&lt;/del&gt;&lt;/a&gt; osd: allow larger osd_thread_info for debug&lt;br/&gt;
Project: fs/lustre-release&lt;br/&gt;
Branch: master&lt;br/&gt;
Current Patch Set: 1&lt;br/&gt;
Commit: 9d2a721fa5289f788f9c3c718752abe5fb1d8517&lt;/p&gt;</comment>
                            <comment id="108635" author="bzzz" created="Tue, 3 Mar 2015 20:00:22 +0000"  >&lt;p&gt;John, would you mind to put CLASSERT() under #ifndef CONFIG_DEBUG_MUTEXES and #ifndef CONFIG_DEBUG_SPINLOCK  please ?&lt;/p&gt;</comment>
                            <comment id="108633" author="jhammond" created="Tue, 3 Mar 2015 19:41:31 +0000"  >&lt;p&gt;It could also be converted to WARN_ON().&lt;/p&gt;</comment>
                            <comment id="108623" author="bzzz" created="Tue, 3 Mar 2015 18:29:20 +0000"  >&lt;p&gt;though I&apos;m fine to disable the check like you suggested.&lt;/p&gt;</comment>
                            <comment id="108622" author="bzzz" created="Tue, 3 Mar 2015 18:28:53 +0000"  >&lt;p&gt;Andreas, that&apos;s possible with &lt;a href=&quot;http://review.whamcloud.com/#/c/5572/&quot; class=&quot;external-link&quot; target=&quot;_blank&quot; rel=&quot;nofollow noopener&quot;&gt;http://review.whamcloud.com/#/c/5572/&lt;/a&gt; (capa support removal):&lt;/p&gt;

&lt;p&gt;(gdb) p sizeof(struct lustre_capa_key)&lt;br/&gt;
$1 = 72&lt;br/&gt;
(gdb) p sizeof(struct lustre_capa)&lt;br/&gt;
$2 = 120&lt;/p&gt;
</comment>
                            <comment id="108617" author="adilger" created="Tue, 3 Mar 2015 18:16:44 +0000"  >&lt;p&gt;It seems unlikely that the struct can shrink by another 112 bytes. It might make sense to find the CONFIG option(s that John has enabled that makes the struct so large compared to the default config from RHEL and put the CLASSERT under #ifndef so that it doesn&apos;t trip in that case. &lt;/p&gt;</comment>
                    </comments>
                <issuelinks>
                            <issuelinktype id="10011">
                    <name>Related</name>
                                            <outwardlinks description="is related to ">
                                        <issuelink>
            <issuekey id="20139">LU-3680</issuekey>
        </issuelink>
                            </outwardlinks>
                                                        </issuelinktype>
                    </issuelinks>
                <attachments>
                            <attachment id="17167" name="config-2.6.32-431.29.2.el6.lustre.x86_64" size="105000" author="jhammond" created="Tue, 3 Mar 2015 13:57:43 +0000"/>
                    </attachments>
                <subtasks>
                    </subtasks>
                <customfields>
                                                                                                                                                                                            <customfield id="customfield_10890" key="com.atlassian.jira.plugins.jira-development-integration-plugin:devsummary">
                        <customfieldname>Development</customfieldname>
                        <customfieldvalues>
                            
                        </customfieldvalues>
                    </customfield>
                                                                                                                                                                                                                                                                                                                                                        <customfield id="customfield_10390" key="com.pyxis.greenhopper.jira:gh-lexo-rank">
                        <customfieldname>Rank</customfieldname>
                        <customfieldvalues>
                            <customfieldvalue>1|hzx7in:</customfieldvalue>

                        </customfieldvalues>
                    </customfield>
                                                                <customfield id="customfield_10090" key="com.pyxis.greenhopper.jira:gh-global-rank">
                        <customfieldname>Rank (Obsolete)</customfieldname>
                        <customfieldvalues>
                            <customfieldvalue>17696</customfieldvalue>
                        </customfieldvalues>
                    </customfield>
                                                                                            <customfield id="customfield_10060" key="com.atlassian.jira.plugin.system.customfieldtypes:select">
                        <customfieldname>Severity</customfieldname>
                        <customfieldvalues>
                                <customfieldvalue key="10022"><![CDATA[3]]></customfieldvalue>

                        </customfieldvalues>
                    </customfield>
                                                                                                                                                                                                                                                                                                                                                        </customfields>
    </item>
</channel>
</rss>